havenxie/HC32Lxx-FirmWare/HC32L110Code_Lib/lib/inc/hc32lxx.h
#ifndef __HC32LXX_H
#define __HC32LXX_H

#ifdef __cplusplus
 extern "C" {
#endif 
//  
#if defined ( __CC_ARM   )
#pragma anon_unions
#endif
     
     
#define HC32L110X6
#define assert_param(expr) ((void)0)

#if !defined (HC32L110x6)
 //#error "Please select first the target HC32L110X6 device used in your application (in hc32lxx.h file)"
#endif

#if !defined  USE_STDPERIPH_DRIVER

#endif /* USE_STDPERIPH_DRIVER */


#if !defined  (HSE_VALUE)     
#define HSE_VALUE    ((uint32_t)32000000) /*!< Value of the External oscillator in Hz*/
#endif /* HSE_VALUE */

/**
 * @brief In the following line adjust the External High Speed oscillator (HSE) Startup 
   Timeout value 
   */
#if !defined  (HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT   ((uint16_t)0x3) /*!< Time out for HSE start up */
#endif /* HSE_STARTUP_TIMEOUT */

/**
 * @brief In the following line adjust the Internal High Speed oscillator (HSI) Startup 
   Timeout value 
   */
#if !defined  (HSI_STARTUP_TIMEOUT)
#define HSI_STARTUP_TIMEOUT   ((uint16_t)0x3) /*!< Time out for HSI start up */
#endif /* HSI_STARTUP_TIMEOUT */

#if !defined  (HSI_VALUE) 
#define HSI_VALUE  ((uint32_t)4000000) /*!< Value of the Internal High Speed oscillator in Hz.
                                             The real value may vary depending on the variations
                                             in voltage and temperature.  */
#endif /* HSI_VALUE */

#if !defined  (HSI14_VALUE) 
#define HSI14_VALUE ((uint32_t)14000000) /*!< Value of the Internal High Speed oscillator for ADC in Hz.
                                             The real value may vary depending on the variations
                                             in voltage and temperature.  */
#endif /* HSI14_VALUE */

#if !defined  (LSI_VALUE) 
#define LSI_VALUE  ((uint32_t)38400)    /*!< Value of the Internal Low Speed oscillator in Hz
                                             The real value may vary depending on the variations
                                             in voltage and temperature.  */
#endif /* LSI_VALUE */

#if !defined  (LSE_VALUE) 
#define LSE_VALUE  ((uint32_t)32768)    /*!< Value of the External Low Speed oscillator in Hz */
#endif /* LSE_VALUE */


/**
 * @brief HC32Lxx Interrupt Number Definition, according to the selected device 
 *        in @ref Library_configuration_section 
 */
 #define __MPU_PRESENT           0 /* No MPU                                        */
#define __NVIC_PRIO_BITS        2 /* M0P uses 2 Bits for the Priority Levels       */
#define __Vendor_SysTickConfig  0 /* Set to 1 if different SysTick Config is used */
#define __VTOR_PRESENT          1


typedef enum IRQn
{
/* -------------------  Cortex-M0+ Processor Exceptions Numbers  ------------------ */
  IRQn_NonMaskableInt           = -14,      /*!<  2 Non Maskable Interrupt          */
  IRQn_HardFault                = -13,      /*!<  3 HardFault Interrupt             */



  IRQn_SVCall                   =  -5,      /*!< 11 SV Call Interrupt               */

  IRQn_PendSV                   =  -2,      /*!< 14 Pend SV Interrupt               */
  SysTick_IRQn                  =  -1,      /*!< 15 System Tick Interrupt           */

/* ----------------------  ARMCM0 Specific Interrupt Numbers  --------------------- */
  IRQn_GPIO_P0                  =   0,      
  IRQn_GPIO_P1                  =   1,     
  IRQn_GPIO_P2                  =   2,     
  IRQn_GPIO_P3                  =   3,      
  IRQn_UART0                    =   6,      
  IRQn_UART1                    =   7,     
  IRQn_UART2                    =   8,     
  IRQn_SPI                      =  10,            
  IRQn_I2C                      =  12,        
  IRQn_BASE_TIMER0              =  14,    
  IRQn_BASE_TIMER1              =  15,     
  IRQn_BASE_TIMER2              =  16,     
  IRQn_BASE_TIMER3              =  17,     
  IRQn_ADV_TIMER0               =  18,      
  IRQn_ADV_TIMER1               =  19,      
  IRQn_ADV_TIMER2               =  20,     
  IRQn_PCA                      =  21,          
  IRQn_WDT                      =  22,    
  IRQn_RTC                      =  23,      
  IRQn_ADC                      =  24,      
//  DAC_IRQn                      =  25,      
  IRQn_VC1                      =  26,      
  IRQn_VC2                      =  27,      
  IRQn_LVD                      =  28,      
//  LCD_IRQn                      =  29,      
  IRQn_RAM_FLASH_FAULT          =  30,      
  IRQn_CLOCK_TRIM               =  31,     
} IRQn_Type;
/*!< Interrupt Number Definition */
/**
  * @}
  */

#include "core_cm0plus.h"
#define SCB_SCR (*(volatile unsigned long *)0XE000ED10)
#include <stdint.h>

/** @addtogroup Exported_types
  * @{
  */  

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/** @addtogroup Peripheral_registers_structures
  * @{
  */   

/** 
  * @brief Analog to Digital Converter  
  */
	
#define UART0_BASEADDR       (0x40000000)
#define UART1_BASEADDR       (0x40000100)
#define UART2_BASEADDR       (0x40000200)
#define I2C_BASEADDR       	 (0x40000400)	
#define SPI_BASEADDR         (0x40000800)	
#define BTIMER_BASEADDR      (0x40000C00)
#define BTIMER0_BASEADDR     (0x40000C00)
#define BTIMER1_BASEADDR     (0x40000C20)
#define BTIMER2_BASEADDR     (0x40000C40)
#define BTIMERLP_BASEADDR    (0x40000C60)
#define BTIMERWDT_BASEADDR   (0x40000C80)

#define PCA_BASEADDR         (0x40001000)
#define RTC_BASEADDR         (0x40001400)
#define CLK_TRIM_BASEADDR    (0x40001800)
#define RNG_BASEADDR         (0x40001C00)
#define SYSTEM_CTRL_BASEADDR (0x40002000) 
#define ANALOGCTRL_BASEADDR  (0x40002400)
#define TIM4_BASEADDR        (0x40003000)	
#define TIM5_BASEADDR        (0x40003400)	
#define TIM6_BASEADDR        (0x40003800)	

#define EFLASH_CTRL_BASEADDR (0x40020000)
#define RAM_CTRL_BASEADDR    (0x40020400)
#define DES_BASEADDR         (0x40020800)
#define CRC_BASEADDR         (0x40020900)
#define PORT_CTRL_BASEADDR   (0x40020C00)


//Defines the REG ADDR for UART0
		#define UART0__SBUF         *((volatile unsigned int  *)(UART0_BASEADDR+0x00))
		#define UART0__SCON         *((volatile unsigned int  *)(UART0_BASEADDR+0x04))
		#define UART0__SADDR        *((volatile unsigned int  *)(UART0_BASEADDR+0x08))
		#define UART0__SADEN        *((volatile unsigned int  *)(UART0_BASEADDR+0x0c))
		#define UART0__SFLAG        *((volatile unsigned int  *)(UART0_BASEADDR+0x10))
		#define UART0__SFCLR        *((volatile unsigned int  *)(UART0_BASEADDR+0x14))
			
//Defines the REG ADDR for UART1
		#define UART1__SBUF         *((volatile unsigned int  *)(UART1_BASEADDR+0x00))
		#define UART1__SCON         *((volatile unsigned int  *)(UART1_BASEADDR+0x04))
		#define UART1__SADDR        *((volatile unsigned int  *)(UART1_BASEADDR+0x08))
		#define UART1__SADEN        *((volatile unsigned int  *)(UART1_BASEADDR+0x0c))
		#define UART1__SFLAG        *((volatile unsigned int  *)(UART1_BASEADDR+0x10))
		#define UART1__SFCLR        *((volatile unsigned int  *)(UART1_BASEADDR+0x14))
			
//Defines the REG ADDR for UART2/LPUART
		#define UART2__SBUF         *((volatile unsigned int  *)(UART2_BASEADDR+0x00))
		#define UART2__SCON         *((volatile unsigned int  *)(UART2_BASEADDR+0x04))
		#define UART2__SADDR        *((volatile unsigned int  *)(UART2_BASEADDR+0x08))
		#define UART2__SADEN        *((volatile unsigned int  *)(UART2_BASEADDR+0x0c))
		#define UART2__ISR          *((volatile unsigned int  *)(UART2_BASEADDR+0x10))
		#define UART2__ICR          *((volatile unsigned int  *)(UART2_BASEADDR+0x14))
			
//Defines the REG ADDR for I2C (0x40000400)
		#define I2C__TMRUN          *((volatile unsigned int  *)(I2C_BASEADDR+0x00))
		#define I2C__TM             *((volatile unsigned int  *)(I2C_BASEADDR+0x04))
 		#define I2C__CR             *((volatile unsigned int  *)(I2C_BASEADDR+0x08))
  	    #define I2C__DATA           *((volatile unsigned int  *)(I2C_BASEADDR+0x0c))
 		#define I2C__ADDR           *((volatile unsigned int  *)(I2C_BASEADDR+0x10))
 		#define I2C__STAT           *((volatile unsigned int  *)(I2C_BASEADDR+0x14))			
		
//Defines the REG ADDR for SPI (0x40000800)
		#define SPI__CR             *((volatile unsigned int  *)(SPI_BASEADDR+0x00))
		#define SPI__SSN            *((volatile unsigned int  *)(SPI_BASEADDR+0x04))
		#define SPI__STAT           *((volatile unsigned int  *)(SPI_BASEADDR+0x08))
		#define SPI__DATA           *((volatile unsigned int  *)(SPI_BASEADDR+0x0c))
			
