havenxie/HC32Lxx-FirmWare/HC32L110Code_Lib/lib/inc/hc32lxx.h
//Defines the REG ADDR for TIM0
		#define TIM0__ARR           *((volatile unsigned int  *)(BTIMER0_BASEADDR+0x00))
		#define TIM0__CNT           *((volatile unsigned int  *)(BTIMER0_BASEADDR+0x04))
		#define TIM0__CNT32         *((volatile unsigned int  *)(BTIMER0_BASEADDR+0x08))
		#define TIM0__CR            *((volatile unsigned int  *)(BTIMER0_BASEADDR+0x0C))			
		#define TIM0__IFR           *((volatile unsigned int  *)(BTIMER0_BASEADDR+0x10))			
		#define TIM0__ICLR          *((volatile unsigned int  *)(BTIMER0_BASEADDR+0x14))	

//DefineS the REG ADDR for TIM1			
		#define TIM1__ARR           *((volatile unsigned int  *)(BTIMER_BASEADDR+0x20))
		#define TIM1__CNT           *((volatile unsigned int  *)(BTIMER_BASEADDR+0x24))
		#define TIM1__CNT32         *((volatile unsigned int  *)(BTIMER_BASEADDR+0x28))
		#define TIM1__CR            *((volatile unsigned int  *)(BTIMER_BASEADDR+0x2C))			
		#define TIM1__IFR           *((volatile unsigned int  *)(BTIMER_BASEADDR+0x30))			
		#define TIM1__ICLR          *((volatile unsigned int  *)(BTIMER_BASEADDR+0x34))	
			
//Defines the REG ADDR for TIM2			
		#define TIM2__ARR           *((volatile unsigned int  *)(BTIMER_BASEADDR+0x40))
		#define TIM2__CNT           *((volatile unsigned int  *)(BTIMER_BASEADDR+0x44))
		#define TIM2__CNT32         *((volatile unsigned int  *)(BTIMER_BASEADDR+0x48))
		#define TIM2__CR            *((volatile unsigned int  *)(BTIMER_BASEADDR+0x4C))			
		#define TIM2__IFR           *((volatile unsigned int  *)(BTIMER_BASEADDR+0x50))			
		#define TIM2__ICLR          *((volatile unsigned int  *)(BTIMER_BASEADDR+0x54))		
		
//Defines the REG ADDR for LPTIM			
		#define LPTIM__CNT          *((volatile unsigned int  *)(BTIMER_BASEADDR+0x60))
		#define LPTIM__ARR          *((volatile unsigned int  *)(BTIMER_BASEADDR+0x64))
		//#define BTIMER__CNTX        *((volatile unsigned int  *)(BTIMER_BASEADDR+0x68))
		#define LPTIM__CR           *((volatile unsigned int  *)(BTIMER_BASEADDR+0x6C))			
		#define LPTIM__IFR          *((volatile unsigned int  *)(BTIMER_BASEADDR+0x70))			
		#define LPTIM__ICLR         *((volatile unsigned int  *)(BTIMER_BASEADDR+0x74))	
			
//Defines the REG ADDR for WDT
		#define WDT__RST            *((volatile unsigned int *)(BTIMER_BASEADDR+0x80))
		#define WDT__CON            *((volatile unsigned int *)(BTIMER_BASEADDR+0x84))

//Defines the REG ADDR for PCA (0x40001000)
		#define PCA__CCON           *((volatile unsigned int  *)(PCA_BASEADDR+0x00))
		#define PCA__CMOD           *((volatile unsigned int  *)(PCA_BASEADDR+0x04))
		#define PCA__CNT            *((volatile unsigned int  *)(PCA_BASEADDR+0x08))
		#define PCA__CL             *((volatile unsigned int  *)(PCA_BASEADDR+0x0C))
		#define PCA__CCAPM0         *((volatile unsigned int  *)(PCA_BASEADDR+0x10))
		#define PCA__CCAPM1         *((volatile unsigned int  *)(PCA_BASEADDR+0x14))
		#define PCA__CCAPM2         *((volatile unsigned int  *)(PCA_BASEADDR+0x18))
		#define PCA__CCAPM3         *((volatile unsigned int  *)(PCA_BASEADDR+0x1c))
		#define PCA__CCAPM4         *((volatile unsigned int  *)(PCA_BASEADDR+0x20))
		#define PCA__CCAP0H         *((volatile unsigned int  *)(PCA_BASEADDR+0x24))
		#define PCA__CCAP0L         *((volatile unsigned int  *)(PCA_BASEADDR+0x28))
		#define PCA__CCAP1H         *((volatile unsigned int  *)(PCA_BASEADDR+0x2c))
		#define PCA__CCAP1L         *((volatile unsigned int  *)(PCA_BASEADDR+0x30))
		#define PCA__CCAP2H         *((volatile unsigned int  *)(PCA_BASEADDR+0x34))
		#define PCA__CCAP2L         *((volatile unsigned int  *)(PCA_BASEADDR+0x38))
		#define PCA__CCAP3H         *((volatile unsigned int  *)(PCA_BASEADDR+0x3c))
		#define PCA__CCAP3L         *((volatile unsigned int  *)(PCA_BASEADDR+0x40))
		#define PCA__CCAP4H         *((volatile unsigned int  *)(PCA_BASEADDR+0x44))
		#define PCA__CCAP4L         *((volatile unsigned int  *)(PCA_BASEADDR+0x48))
		#define PCA__CCAPO          *((volatile unsigned int  *)(PCA_BASEADDR+0x4c))
		#define PCA__CCAP0          *((volatile unsigned int  *)(PCA_BASEADDR+0x50))
		#define PCA__CCAP1          *((volatile unsigned int  *)(PCA_BASEADDR+0x54))
		#define PCA__CCAP2          *((volatile unsigned int  *)(PCA_BASEADDR+0x58))
		#define PCA__CCAP3          *((volatile unsigned int  *)(PCA_BASEADDR+0x5c))
		#define PCA__CCAP4          *((volatile unsigned int  *)(PCA_BASEADDR+0x60))
		
//Defines the REG ADDR for RTC (0x40001400)
		#define RTC__CR0            *((volatile unsigned int  *)(RTC_BASEADDR+0x00))		
		#define RTC__CR1            *((volatile unsigned int  *)(RTC_BASEADDR+0x04))		
		#define RTC__SEC            *((volatile unsigned int  *)(RTC_BASEADDR+0x08))				
		#define RTC__MIN            *((volatile unsigned int  *)(RTC_BASEADDR+0x0C))
		#define RTC__HOUR           *((volatile unsigned int  *)(RTC_BASEADDR+0x10))
		#define RTC__WEEK           *((volatile unsigned int  *)(RTC_BASEADDR+0x14))
		#define RTC__DAY            *((volatile unsigned int  *)(RTC_BASEADDR+0x18))
		#define RTC__MON            *((volatile unsigned int  *)(RTC_BASEADDR+0x1C))
		#define RTC__YEAR           *((volatile unsigned int  *)(RTC_BASEADDR+0x20))
		#define RTC__ALMMIN         *((volatile unsigned int  *)(RTC_BASEADDR+0x24))
		#define RTC__ALMHOUR        *((volatile unsigned int  *)(RTC_BASEADDR+0x28))
		#define RTC__ALMWEEK        *((volatile unsigned int  *)(RTC_BASEADDR+0x2C))
		#define RTC__COMPEN         *((volatile unsigned int  *)(RTC_BASEADDR+0x30))
		
//Defines the REG ADDR FOR CLKTRIM (0x40001800)
		#define CLKTRIM__CR         *((volatile unsigned int  *)(CLK_TRIM_BASEADDR+0x00))		
		#define CLKTRIM__REFCON     *((volatile unsigned int  *)(CLK_TRIM_BASEADDR+0x04))		
		#define CLKTRIM__REFCNT     *((volatile unsigned int  *)(CLK_TRIM_BASEADDR+0x08))		
		#define CLKTRIM__CALCNT     *((volatile unsigned int  *)(CLK_TRIM_BASEADDR+0x0C))	
		#define CLKTRIM__IFR        *((volatile unsigned int  *)(CLK_TRIM_BASEADDR+0x10))		
		#define CLKTRIM__ICLR       *((volatile unsigned int  *)(CLK_TRIM_BASEADDR+0x14))		
		#define CLKTRIM__CALCON     *((volatile unsigned int  *)(CLK_TRIM_BASEADDR+0x18))			

//#define RNG_BASEADDR (0x40001C00)
		#define RNGCtrlReg          *((volatile unsigned int  *)(RNG_BASEADDR+0x00))
		#define RNGModeReg          *((volatile unsigned int  *)(RNG_BASEADDR+0x04))
		#define RNGSeqReg           *((volatile unsigned int  *)(RNG_BASEADDR+0x08))
		#define RNGData0Reg         *((volatile unsigned int  *)(RNG_BASEADDR+0x0c))
		#define RNGData1Reg         *((volatile unsigned int  *)(RNG_BASEADDR+0x10)) 
		
//#define SYSTEM_CTRL_BASEADDR (0x40002000)
		#define SYSTEM_CTRL__SYSCTRL0       *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x00))		
		#define SYSTEM_CTRL__SYSCTRL1       *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x04))		
		#define SYSTEM_CTRL__SYSCTRL2       *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x08))		
		#define SYSTEM_CTRL__RCH_CR         *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x0C))		
		#define SYSTEM_CTRL__XTH_CR         *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x10))		
		#define SYSTEM_CTRL__RCL_CR         *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x14))		
		#define SYSTEM_CTRL__XTL_CR         *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x18))		
		#define SYSTEM_CTRL__Reset_flag     *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x1C))		
		#define SYSTEM_CTRL__PERI_CLKEN     *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x20))		
		#define SYSTEM_CTRL__PREI_RESET     *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x28))		
		#define SYSTEM_CTRL__WAKEUP_DPSP    *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x30))		
		#define SYSTEM_CTRL__SYSTICK_CR     *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x34))		
		#define SYSTEM_CTRL__DEBUG_ACTIVE   *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x38))		
		#define SYSTEM_CTRL__LOCKSFR        *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x40))		
		#define SYSTEM_CTRL__BOOT0          *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x44))		
		#define SYSTEM_CTRL__BOOT1          *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x48))		
		#define SYSTEM_CTRL__REMAP          *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x4C))		
		#define SYSTEM_CTRL__SECURITY_BYTE  *((volatile unsigned int  *)(SYSTEM_CTRL_BASEADDR+0x50))		

