havenxie/HC32Lxx-FirmWare/HC32L110Code_Lib/lib/inc/hc32lxx.h
//Defines the REG ADDR for ADC
		#define ADC__CR0                 *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x04))			
		#define ADC__CR1                 *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x08))	
		#define ADC__CR2                 *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x0c))
		#define ADC__result0             *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x30))
		#define ADC__result1             *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x34))
		#define ADC__result2             *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x38))		
		#define ADC__result3             *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x3c))		
		#define ADC__result4             *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x40))		
		#define ADC__result5             *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x44))	
		#define ADC__result6             *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x48))
		#define ADC__result7             *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x4c))	
		#define ADC__result8             *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x50))	
		#define ADC__result_acc          *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x54))			
		#define ADC__HT                  *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x58))	
		#define ADC__LT                  *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x5c))
		#define ADC__IFR                 *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x60))	
		#define ADC__ICLR                *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x64))
		#define ADC__result              *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x68))			
		#define ADC__CR3                 *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x70))

//Defines the REG ADDR for PMU
		#define PMU__CR                  *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x74))

//Defines the REG ADDR for BGR
		#define BGR__CR                  *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x00))
		#define BGR__option              *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x78))

//Defines the REG ADDR for VC
		#define VC__CR                   *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x10))
		#define VC__VC0_CR               *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x14))	
		#define VC__VC1_CR               *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x18))	
		#define VC__VC0_OUT_CFG          *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x1c))			
		#define VC__VC1_OUT_CFG          *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x20))
		#define VC__INT                  *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x24))	
		
//Defines the REG ADDR for LVD
		#define LVD__CR                  *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x28))
		#define LVD__IFR                 *((volatile unsigned int  *)(ANALOGCTRL_BASEADDR+0x2c))
		
	
//Defines the REG ADDR for TIM4 (0x40003000)	
		#define TIM4__CNTER 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x00))
		#define TIM4__PERAR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x04))
		#define TIM4__PERBR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x08))
		//#define PERCR 		         *((volatile unsigned int  *)(TIM4_BASEADDR+0x0C))
		#define TIM4__GCMAR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x10))
		#define TIM4__GCMBR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x14))
		#define TIM4__GCMCR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x18))
		#define TIM4__GCMDR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x1C))		
		#define TIM4__DTUAR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x40))
		#define TIM4__DTDAR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x44))
     
		#define TIM4__GCONR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x50))	
		#define TIM4__ICONR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x54))	
		#define TIM4__PCONR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x58))	
		#define TIM4__BCONR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x5C))					
		#define TIM4__DCONR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x60))
		     
		#define TIM4__FCONR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x68))		
		#define TIM4__VPERR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x6C))
		#define TIM4__STFLR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x70))
		#define TIM4__HSTAR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x74))
		#define TIM4__HSTPR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x78))
		#define TIM4__HCLRR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x7C))
		#define TIM4__HCPAR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x80))				
		#define TIM4__HCPBR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x84))
		#define TIM4__HCUPR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x88))
		#define TIM4__HCDOR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x8C))
		//#define GPROR 		         *((volatile unsigned int  *)(TIM4_BASEADDR+0x90))

		#define TIM4__IFR 		         *((volatile unsigned int  *)(TIM4_BASEADDR+0x100))
		#define TIM4__ICLR 		         *((volatile unsigned int  *)(TIM4_BASEADDR+0x104))
		#define TIM4__CR 		         *((volatile unsigned int  *)(TIM4_BASEADDR+0x108))				
		#define TIM4__AOSSR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x110))				
		#define TIM4__AOSCL 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x114))				
		#define TIM4__PTBKS 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x118))
		#define TIM4__TTRIG 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x11C))
		#define TIM4__ITRIG 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x120))
		#define TIM4__PTBKP 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x124))
	    
		#define TIM4__SSTAR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x3F4))	
		#define TIM4__SSTPR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x3F8))	
		#define TIM4__SCLRR 		     *((volatile unsigned int  *)(TIM4_BASEADDR+0x3FC))							
	
//Defines the REG ADDR for TIM5 (0x40003400)	
		#define TIM5__CNTER 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x00))
		#define TIM5__PERAR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x04))
		#define TIM5__PERBR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x08))
		//#define PERCR 		         *((volatile unsigned int  *)(TIM5_BASEADDR+0x0C))
		#define TIM5__GCMAR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x10))
		#define TIM5__GCMBR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x14))
		#define TIM5__GCMCR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x18))
		#define TIM5__GCMDR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x1C))		
		#define TIM5__DTUAR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x40))
		#define TIM5__DTDAR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x44))
     
		#define TIM5__GCONR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x50))	
		#define TIM5__ICONR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x54))	
		#define TIM5__PCONR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x58))	
		#define TIM5__BCONR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x5C))					
		#define TIM5__DCONR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x60))
		     
		#define TIM5__FCONR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x68))		
		#define TIM5__VPERR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x6C))
		#define TIM5__STFLR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x70))
		#define TIM5__HSTAR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x74))
		#define TIM5__HSTPR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x78))
		#define TIM5__HCLRR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x7C))
		#define TIM5__HCPAR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x80))				
		#define TIM5__HCPBR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x84))
		#define TIM5__HCUPR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x88))
		#define TIM5__HCDOR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x8C))
		//#define GPROR 		         *((volatile unsigned int  *)(TIM5_BASEADDR+0x90))
		 
		#define TIM5__IFR 		         *((volatile unsigned int  *)(TIM5_BASEADDR+0x100))
		#define TIM5__ICLR 		         *((volatile unsigned int  *)(TIM5_BASEADDR+0x104))
		#define TIM5__CR 		         *((volatile unsigned int  *)(TIM5_BASEADDR+0x108))				
		#define TIM5__AOSSR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x110))				
		#define TIM5__AOSCL 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x114))				
		#define TIM5__PTBKS 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x118))
		#define TIM5__TTRIG 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x11C))
		#define TIM5__ITRIG 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x120))
		#define TIM5__PTBKP 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x124))
	    
		#define TIM5__SSTAR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x3F4))	
		#define TIM5__SSTPR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x3F8))	
		#define TIM5__SCLRR 		     *((volatile unsigned int  *)(TIM5_BASEADDR+0x3FC))
							
//Defines the REG ADDR for TIM6 (0x40003800)			
		#define TIM6__CNTER 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x00))
		#define TIM6__PERAR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x04))
		#define TIM6__PERBR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x08))
		//#define PERCR 		         *((volatile unsigned int  *)(TIM6_BASEADDR+0x0C))
		#define TIM6__GCMAR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x10))
		#define TIM6__GCMBR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x14))
		#define TIM6__GCMCR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x18))
		#define TIM6__GCMDR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x1C))		
		#define TIM6__DTUAR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x40))
		#define TIM6__DTDAR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x44))
     
		#define TIM6__GCONR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x50))	
		#define TIM6__ICONR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x54))	
		#define TIM6__PCONR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x58))	
		#define TIM6__BCONR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x5C))					
		#define TIM6__DCONR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x60))
		     
