havenxie/HC32Lxx-FirmWare/HC32L110Code_Lib/lib/inc/hc32lxx.h
		#define TIM6__FCONR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x68))		
		#define TIM6__VPERR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x6C))
		#define TIM6__STFLR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x70))
		#define TIM6__HSTAR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x74))
		#define TIM6__HSTPR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x78))
		#define TIM6__HCLRR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x7C))
		#define TIM6__HCPAR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x80))				
		#define TIM6__HCPBR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x84))
		#define TIM6__HCUPR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x88))
		#define TIM6__HCDOR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x8C))
		//#define GPROR 		         *((volatile unsigned int  *)(TIM6_BASEADDR+0x90))
		 
		#define TIM6__IFR 		         *((volatile unsigned int  *)(TIM6_BASEADDR+0x100))
		#define TIM6__ICLR 		         *((volatile unsigned int  *)(TIM6_BASEADDR+0x104))
		#define TIM6__CR 		         *((volatile unsigned int  *)(TIM6_BASEADDR+0x108))				
		#define TIM6__AOSSR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x110))				
		#define TIM6__AOSCL 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x114))				
		#define TIM6__PTBKS 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x118))
		#define TIM6__TTRIG 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x11C))
		#define TIM6__ITRIG 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x120))
		#define TIM6__PTBKP 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x124))
	    
		#define TIM6__SSTAR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x3F4))	
		#define TIM6__SSTPR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x3F8))	
		#define TIM6__SCLRR 		     *((volatile unsigned int  *)(TIM6_BASEADDR+0x3FC))

//#define GPIO_BASEADDR (0x40001600)
//		#define GPIO0_DIR         *((volatile unsigned int  *)(GPIO_BASEADDR+0x00))
//		#define GPIO0_REG         *((volatile unsigned int  *)(GPIO_BASEADDR+0x04))
//		#define GPIO0             *((volatile unsigned int  *)(GPIO_BASEADDR+0x08))

//Defines the REG ADDR for FLASH  (0x40020000)
		#define FLASH__TNVS              *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x00))
		#define FLASH__TPGS              *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x04))
		#define FLASH__TPROG             *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x08))
		#define FLASH__TSERASE           *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x0c))
		#define FLASH__TMERASE           *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x10))
		#define FLASH__TPRCV             *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x14))
		#define FLASH__TSRCV             *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x18))
		#define FLASH__TMRCV             *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x1c))			
		#define FLASH__CR                *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x20))
		#define FLASH__IFR               *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x24))	
        #define FLASH__ICLR              *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x28))	
		#define FLASH__BYPASS            *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x2C))
		#define FLASH__SLOCK             *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x30))
/*
		#define INFO__PL            *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x34))
		#define FLASH__FCLR         *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x38))
			  
		#define FLASH_TRIM0         *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x200))
		#define FLASH_TRIM1         *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x204))
		#define FLASH_TRIM2         *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x208))
		#define FLASH_TRIM3         *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x20c))
		#define FLASH_TRIM4         *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x210))
		#define FLASH_TRIM5         *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x214))
		#define FLASH_TRIM6         *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x218))
		#define FLASH_TRIM7         *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x21c))
		#define FLASH_TRIM8         *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x220))
		#define FLASH_TRIM9         *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x224))
		#define FLASH_TRIM10        *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x228))
		#define FLASH_TRIM11        *((volatile unsigned int  *)(EFLASH_CTRL_BASEADDR+0x22c))
*/
//Defines the REG ADDR for RAM (0x40020400)
		#define RAM__CR                  *((volatile unsigned int  *)(RAM_CTRL_BASEADDR+0x00))
		#define RAM__ERRADDR             *((volatile unsigned int  *)(RAM_CTRL_BASEADDR+0x04))
		#define RAM__IFR                 *((volatile unsigned int  *)(RAM_CTRL_BASEADDR+0x08))
		#define RAM__ICLR                *((volatile unsigned int  *)(RAM_CTRL_BASEADDR+0x0C))
			
//#define DES_BASEADDR (0x40020800)
		#define CNTRL_REG                *((volatile unsigned int  *)(DES_BASEADDR+0x00))
    	#define RAND_REG0                *((volatile unsigned int  *)(DES_BASEADDR+0x10))
    	#define RAND_REG1                *((volatile unsigned int  *)(DES_BASEADDR+0x14))
    	#define IV_REG0                  *((volatile unsigned int  *)(DES_BASEADDR+0x18))
    	#define IV_REG1                  *((volatile unsigned int  *)(DES_BASEADDR+0x1c))
    	#define DATA_REG0                *((volatile unsigned int  *)(DES_BASEADDR+0x20))
    	#define DATA_REG1                *((volatile unsigned int  *)(DES_BASEADDR+0x24))
    	#define KEY1_REG0                *((volatile unsigned int  *)(DES_BASEADDR+0x28))
    	#define KEY1_REG1                *((volatile unsigned int  *)(DES_BASEADDR+0x2c))
    	#define KEY2_REG0                *((volatile unsigned int  *)(DES_BASEADDR+0x30))
    	#define KEY2_REG1                *((volatile unsigned int  *)(DES_BASEADDR+0x34))
    	#define KEY3_REG0                *((volatile unsigned int  *)(DES_BASEADDR+0x38))
    	#define KEY3_REG1                *((volatile unsigned int  *)(DES_BASEADDR+0x3c))
    
//Defines the REG ADDR for CRC  
		#define CRC__RESULT              *((volatile unsigned int  *)(CRC_BASEADDR+0x04))
		#define CRC__DATA                *((volatile unsigned int  *)(CRC_BASEADDR+0x80))


//Defiens the REG ADDR for GPIO (0x40020C00)
		#define GPIO__P01_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x04))
		#define GPIO__P02_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x08))
		#define GPIO__P03_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x0C))
		#define GPIO__P14_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x50))
		#define GPIO__P15_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x54))
		#define GPIO__P23_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x8C))
		#define GPIO__P24_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x90))
		#define GPIO__P25_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x94))
		#define GPIO__P26_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x98))
		#define GPIO__P27_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x9C))
		#define GPIO__P31_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0xC4))
		#define GPIO__P32_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0xC8))
		#define GPIO__P33_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0xCC))
		#define GPIO__P34_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0xD0))
		#define GPIO__P35_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0xD4))
		#define GPIO__P36_SEL            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0xD8))
		#define GPIO__P0DIR              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x100))
		#define GPIO__P0IN               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x104))
		#define GPIO__P0OUT              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x108))
		#define GPIO__P0ADS              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x10C))
	    //#define GPIO__P0_CS              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x110))
	    //#define GPIO__P0_SR              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x118))
		#define GPIO__P0DR               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x11C))
		#define GPIO__P0PU               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x120))
		#define GPIO__P0PD               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x124))
		//#define GPIO__P0OS              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x128))
		#define GPIO__P0OD               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x12C))
		#define GPIO__P0INTEN0           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x130))
		#define GPIO__P0INTEN1           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x134))
		#define GPIO__P0INTEN2           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x138))
		#define GPIO__P0INTEN3           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x13C))
		#define GPIO__P0_STAT            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x200))
		#define GPIO__P0_ICLR            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x210))
		#define GPIO__P1DIR              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x140))
		#define GPIO__P1IN               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x144))
		#define GPIO__P1OUT              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x148))
		#define GPIO__P1ADS              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x14C))
		//#define GPIO__P1CS              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x150))
		//#define GPIO__P1SR              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x158))
		#define GPIO__P1DR               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x15C))
		#define GPIO__P1PU               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x160))
		#define GPIO__P1PD               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x164))
		//#define GPIO__P1_OS              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x168))
		#define GPIO__P1OD               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x16C))
		#define GPIO__P1INTEN0           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x170))
		#define GPIO__P1INTEN1           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x174))
		#define GPIO__P1INTEN2           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x178))
		#define GPIO__P1INTEN3           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x17C))
		#define GPIO__P1_STAT            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x240))
		#define GPIO__P1_ICLR            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x250))
		#define GPIO__P2DIR              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x180))
		#define GPIO__P2IN               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x184))
		#define GPIO__P2OUT              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x188))
		#define GPIO__P2ADS              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x18C))
		//#define GPIO__P2_CS              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x190))
		//#define GPIO__P2_SR              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x198))
		#define GPIO__P2_DR              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x19C))
		#define GPIO__P2_PU              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1A0))
		#define GPIO__P2_PD              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1A4))
		//#define GPIO__P2_OS              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1A8))
		#define GPIO__P2_OD              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1AC))
		#define GPIO__P2INTEN0           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1B0))
		#define GPIO__P2INTEN1           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1B4))
		#define GPIO__P2INTEN2           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1B8))
		#define GPIO__P2INTEN3           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1BC))
		#define GPIO__P2_STAT            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x280))
		#define GPIO__P2_ICLR            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x290))
		#define GPIO__P3DIR              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1C0))
		#define GPIO__P3IN               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1C4))
		#define GPIO__P3OUT              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1C8))
		#define GPIO__P3ADS              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1CC))
		//#define GPIO__P3_CS              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1D0))
		//#define GPIO__P3_SR              *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1D8))
		#define GPIO__P3DR               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1DC))
		#define GPIO__P3PU               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1E0))
		#define GPIO__P3PD               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1E4))
		//#define GPIO__P3OS               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1E8))
		#define GPIO__P3OD               *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1EC))
		#define GPIO__P3INTEN0           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1F0))
		#define GPIO__P3INTEN1           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1F4))
		#define GPIO__P3INTEN2           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1F8))
		#define GPIO__P3INTEN3           *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x1FC))
		#define GPIO__P3_STAT            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x2C0))
		#define GPIO__P3_ICLR            *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x2D0))
		#define GPIO__GPIO_CTRL0         *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x300))
		#define GPIO__GPIO_CTRL1         *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x304))
		#define GPIO__GPIO_CTRL2         *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x308))
		#define GPIO__GPIO_CTRL3         *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x30C))
		#define GPIO__GPIO_CTRL4         *((volatile unsigned int  *)(PORT_CTRL_BASEADDR+0x310))
		  
#define PPB_BASEADDR      (0xe000e000)  
    	#define NVIC_ISER                *((volatile unsigned int  *)(PPB_BASEADDR+0x100)) 	
    	#define NVIC_ICER                *((volatile unsigned int  *)(PPB_BASEADDR+0x180))	
			   
    	#define SLEEPDEEP                *((volatile unsigned int  *)(PPB_BASEADDR+0xd10)) 
/*
#define NVIC_BASEADDR      (0xe000e000)
    #define NVIC_ISER           *((volatile unsigned int *)(NVIC_BASEADDR+0x100)) 	
    #define NVIC_ICER           *((volatile unsigned int *)(NVIC_BASEADDR+0x180))	
*/			

/*  **********   UART struct    **********  */
typedef struct 
{
	__IO uint32_t SBUF     : 8;
	__IO uint32_t RERSEVED : 24;
}uart_sbuf_field_t;

typedef struct
{
  __IO uint32_t RIEN      : 1; 
  __IO uint32_t TIEN      : 1;	
  __IO uint32_t RB8       : 1;
  __IO uint32_t TB8       : 1;
  __IO uint32_t REN       : 1;
  __IO uint32_t SM2       : 1;
  __IO uint32_t SM01      : 2;
  __IO uint32_t RERSEVED  : 1;
  __IO uint32_t DBAUD     : 1;
  __IO uint32_t RERSEVED1 : 22;       
}uart_scon_field_t; 

typedef struct
{
	__IO uint32_t RIEN    : 1;
	__IO uint32_t TIEN    : 1;
	__IO uint32_t RB8     : 1;
	__IO uint32_t TB8	  : 1;
	__IO uint32_t REN     : 1;
	__IO uint32_t SM2     : 1;
	__IO uint32_t SM01    : 2;
	__IO uint32_t TEEM    : 1;
	__IO uint32_t DBAUD   : 1;
	__IO uint32_t LPMODE  : 1;
	__IO uint32_t SCLKSEL : 2;
	__IO uint32_t PRS     : 3;
	__IO uint32_t RERSEVED : 16;
}lpuart_scon_field_t;

typedef struct
{
	__IO uint32_t SADDR    : 8;
	__IO uint32_t RESERVED : 24;
}uart_saddr_field_t;

typedef struct
{
	__IO uint32_t SADEN     : 8;
	__IO uint32_t RERSEVED  : 24;
}uart_saden_field_t;

typedef struct
{
	__IO uint32_t RI        : 1;
	__IO uint32_t TI        : 1;
	__IO uint32_t FE        : 1;
	__IO uint32_t TE        : 1;
	__IO uint32_t RERSEVED  : 28;
}uart_isr_field_t;

typedef struct
{
	__IO uint32_t RI_CLR        : 1;
	__IO uint32_t TI_CLR        : 1;
	__IO uint32_t FE_CLR        : 1;
	__IO uint32_t RERSEVED      : 29;
}uart_icr_field_t;

typedef struct
{
  union {
  	  __IO  uint32_t SBUF;	
  	  uart_sbuf_field_t SBUF_f;
  };
	
  union {
      __IO  uint32_t SCON;
      uart_scon_field_t SCON_f;
      lpuart_scon_field_t LP_SCON_f;
  };
  
  union {
  	  __IO  uint32_t SADDR;
  	  uart_saddr_field_t SADDR_f;
  };

  union {
  	  __IO  uint32_t SADEN;  
  	  uart_saden_field_t SADEN_f;
  };

  union {
      __IO  uint32_t ISR;
      uart_isr_field_t ISR_f;
  };  
  
  union {
      __IO  uint32_t ICR;
      uart_icr_field_t ICR_f;
  }; 
}UART_REG_TypeDef;

#define L005_UART0           ((UART_REG_TypeDef *)UART0_BASEADDR)
#define L005_UART1           ((UART_REG_TypeDef *)UART1_BASEADDR)
#define L005_UART2           ((UART_REG_TypeDef *)UART2_BASEADDR)


/*  **********   I2C struct    **********  */
	
typedef struct
{
	__IO uint32_t tme	    	    : 1;
	__IO uint32_t RERSEVED	        : 30;	
}i2c_tmr_field_t;

typedef struct
{
	__IO uint32_t tm                : 8;
	__IO uint32_t RERSEVED	        : 24;	
}i2c_tm_field_t;

typedef struct
{
	__IO uint32_t h1m               : 1;
	__IO uint32_t RERSEVED0	        : 1;
	__IO uint32_t aa 				: 1;
	__IO uint32_t si				: 1;
	__IO uint32_t sto				: 1;
	__IO uint32_t sta				: 1;
	__IO uint32_t ens    			: 1;
	__IO uint32_t RERSEVED1	        : 25;
}i2ccon_field_t;

typedef struct 
{
	__IO uint32_t i2cdat            : 8;
	__IO uint32_t RESERVED          : 24;
}i2cdata_field_t;

typedef struct
{
	__IO uint32_t GC				: 1;
	__IO uint32_t i2cadr            : 7;
	__IO uint32_t RERSEVED	        : 24;	
}i2cadr_field_t;

typedef struct
{
	__IO uint32_t i2csta  			: 8;
	__IO uint32_t RERSEVED			: 24;	
}i2cstat_field_t;

typedef struct
{
  union {
	  __IO  uint32_t TMRUN;
	  i2c_tmr_field_t TMRUN_f;
  };
	
  union {
      __IO  uint32_t TM;
      i2c_tm_field_t TM_f;
  };
	
  union {
      __IO  uint32_t CR;
      i2ccon_field_t CR_f;
  };
  
  union {
  	  __IO uint32_t DATA;
  	  i2cdata_field_t DATA_f;
  };
	
  union {
      __IO  uint32_t ADDR;
	  i2cadr_field_t ADDR_f;
  };
	
  union {
      __IO  uint32_t STAT;
      i2cstat_field_t STAT_f;
  };
	
}I2C_REG_TypeDef;	
	
#define L005_I2C            	((I2C_REG_TypeDef *)I2C_BASEADDR)	


/*  **********   SPI struct    **********  */

typedef struct
{
	__IO uint32_t spr0      : 1;
	__IO uint32_t spr1      : 1;	
	__IO uint32_t cpha      : 1;
	__IO uint32_t cpol      : 1;
	__IO uint32_t mstr      : 1;
	__IO uint32_t RERSEVED  : 1;
	__IO uint32_t spen      : 1;
	__IO uint32_t spr2      : 1;
	__IO uint32_t RERSEVED1 : 24;	
}spi_cr_field_t;

typedef struct 
{
	__IO uint32_t ssn       : 1;
	__IO uint32_t RESERVED  : 31;
}spi_ssn_field_t;

typedef struct
{
	__IO uint32_t RERSEVED  : 4;
	__IO uint32_t mdf       : 1;	
	__IO uint32_t sserr     : 1;
	__IO uint32_t wcol      : 1;
	__IO uint32_t spif      : 1;
	__IO uint32_t RERSEVED1 : 24;	
}spi_spsta_field_t;

typedef struct
{
	__IO uint32_t spdat     : 8;
	__IO uint32_t RESERVED  : 24;
}spi_data_field_t;

typedef struct
{
  union {
      __IO  uint32_t CR;
      spi_cr_field_t CR_f;
  };
  
  union {
  	  __IO uint32_t SSN;
  	  spi_ssn_field_t SSN_f;
  };

  union {
      __IO  uint32_t STAT;
      spi_spsta_field_t STAT_f;
  };
  
  union {
  	  __IO  uint32_t DATA;
  	  spi_data_field_t DATA_f;
  };

}SPI_REG_TypeDef;	

