havenxie/HC32Lxx-FirmWare/HC32L110Code_Lib/lib/inc/hc32lxx.h
#define L005_SPI             ((SPI_REG_TypeDef *)SPI_BASEADDR)	       

/*  **********   BTIMER struct    **********  */

typedef struct
{
	__IO uint32_t ARR      : 16;
	__IO uint32_t RERSEVED : 16;
}btimer_arr_field_t;

typedef struct
{
	__IO uint32_t CNT      : 16;
	__IO uint32_t RERSEVED : 16;
}btimer_cnt_field_t;

typedef struct
{
	__IO uint32_t TR       : 1;	
	__IO uint32_t MD       : 1;	
	__IO uint32_t CT       : 1;	
	__IO uint32_t TOG_EN   : 1;	
	__IO uint32_t PRS      : 3;	
	__IO uint32_t RESERVED : 1;	
	__IO uint32_t GATE     : 1;	
	__IO uint32_t GATE_P   : 1;	
	__IO uint32_t IE       : 1;	
	__IO uint32_t RERSEVED1 : 21;	
	
}btimer_cr_field_t;	

typedef struct
{
	__IO uint32_t TR        : 1;
	__IO uint32_t MD        : 1;
	__IO uint32_t CT        : 1;
	__IO uint32_t TOG_EN    : 1;
	__IO uint32_t TCK_SEL   : 2;
	__IO uint32_t RERSEVED  : 1;
	__IO uint32_t WT_FLAG   : 1;
	__IO uint32_t GATE      : 1;
	__IO uint32_t GATE_P    : 1;
	__IO uint32_t IE        : 1;
	__IO uint32_t RERSEVED1 : 21;
}btimerlp_cr_field_t;

typedef struct
{
	__IO uint32_t TF       : 1;	
	__IO uint32_t RERSEVED : 31;	
	
}btimer_ifr_field_t;


typedef struct
{
	__IO uint32_t TFC       : 1;	
	__IO uint32_t RESERVED  : 31;	
	
}btimer_iclr_field_t;	


typedef struct
{
	union {
		__IO uint32_t ARR;
		btimer_arr_field_t ARR_f;
	};
	union {
		__IO uint32_t CNT;
		btimer_cnt_field_t CNT_f;
	};
	__IO uint32_t CNT32;
	union {
		__IO uint32_t CR;
		btimer_cr_field_t CR_f;
	};
    union {
	    __IO uint32_t IFR;
	    btimer_ifr_field_t IFR_f;
    };
    union {  
	    __IO uint32_t ICLR;
	    btimer_iclr_field_t ICLR_f;
    };
 
}BTIMER_REG_TypeDef;

typedef struct
{
	union {
    	__IO uint32_t CNT;
		btimer_cnt_field_t CNT_f;
	};
	union {
		__IO uint32_t ARR;
		btimer_arr_field_t ARR_f;
	};
	__IO uint32_t RERSEVED;
    union {
  	    __IO uint32_t CR;
  	    btimerlp_cr_field_t CR_f;
    };
    union {
    	__IO uint32_t IFR;
    	btimer_ifr_field_t IFR_f;
    };
    union {
    	__IO uint32_t ICLR;
    	btimer_iclr_field_t ICLR_f;
    };
 
}BTIMERLP_REG_TypeDef;

	 
#define L005_TIM0         ((BTIMER_REG_TypeDef *)BTIMER0_BASEADDR)	 
#define L005_TIM1         ((BTIMER_REG_TypeDef *)BTIMER1_BASEADDR)	 
#define L005_TIM2         ((BTIMER_REG_TypeDef *)BTIMER2_BASEADDR)	 
#define L005_LPTIM        ((BTIMERLP_REG_TypeDef *)BTIMERLP_BASEADDR)	 
 

/*  **********   WDT struct    **********  */

typedef struct
{
	__IO uint32_t WOV       : 4;
	__IO uint32_t WDTR      : 1;
	__IO uint32_t WINT_EN   : 1;
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t WDINT     : 1;
	__IO uint32_t WCNTL     : 8;
	__IO uint32_t RERSEVED1 : 16;
}wdtcon_field_t;	

typedef struct
{
	__IO uint32_t RST;
    union {
        __IO uint32_t CON;
        wdtcon_field_t CON_f;
    };
}WDT_REG_TypeDef;

#define L005_WDT             ((WDT_REG_TypeDef *)BTIMERWDT_BASEADDR)	
 

/*  **********   PCA struct    **********  */

typedef struct
{
	__IO uint32_t CCF0      : 1;
	__IO uint32_t CCF1      : 1;	
	__IO uint32_t CCF2      : 1;
	__IO uint32_t CCF3      : 1;
	__IO uint32_t CCF4      : 1;
	__IO uint32_t RERSEVED  : 1;
	__IO uint32_t CR        : 1;
	__IO uint32_t CF        : 1;
	__IO uint32_t RERSEVED1 : 24;	
}pca_ccon_field_t;	

typedef struct
{
	__IO uint32_t CCF0      : 1;
	__IO uint32_t CCF1      : 1;	
	__IO uint32_t CCF2      : 1;
	__IO uint32_t CCF3      : 1;
	__IO uint32_t CCF4      : 1;
	__IO uint32_t RERSEVED  : 2;
	__IO uint32_t CF        : 1;
	__IO uint32_t RERSEVED1 : 24;	
}pca_intcl_field_t;	

typedef struct
{
	__IO uint32_t CFIE      : 1;
	__IO uint32_t CPS       : 3;	
	__IO uint32_t RERSEVED0 : 2;
	
	__IO uint32_t WDTE      : 1;
	__IO uint32_t CIDL      : 1;
	__IO uint32_t RERSEVED1 : 24;	
}pca_cmod_field_t;

typedef struct
{
	__IO uint32_t CNT       : 16;
	__IO uint32_t RERSEVED  : 16;
}pca_cnt_field_t;

typedef struct
{
	__IO uint32_t CCIE     : 1;
	__IO uint32_t PWM      : 1;	
	__IO uint32_t TOG      : 1;
	__IO uint32_t MAT      : 1;
	__IO uint32_t CAPN     : 1;
	__IO uint32_t CAPP     : 1;
	__IO uint32_t ECOM     : 1;
	__IO uint32_t RERSEVED : 25;	
}pca_ccapm_field_t;

typedef struct
{
	union{
		__IO uint32_t CCON;
		pca_ccon_field_t CCON_f;
	};
	union{
		__IO uint32_t CMOD;
		pca_cmod_field_t CMOD_f;
	};
	union{
		__IO uint32_t CNT;
		pca_cnt_field_t CNT_f;
	};
	union{
		__IO uint32_t INT_CL;
		pca_intcl_field_t INT_CL_f;
    };
	union{
		__IO uint32_t CCAPM0;
		pca_ccapm_field_t CCAPM0_f;
	};
	union{
		__IO uint32_t CCAPM1;
		pca_ccapm_field_t CCAPM1_f;
	};
	union{
		__IO uint32_t CCAPM2;
		pca_ccapm_field_t CCAPM2_f;
	};
	union{
		__IO uint32_t CCAPM3;
		pca_ccapm_field_t CCAPM3_f;
	};
	union{
		__IO uint32_t CCAPM4;
		pca_ccapm_field_t CCAPM4_f;
	};
	__IO uint32_t CCAP0H;
	__IO uint32_t CCAP0L;
	__IO uint32_t CCAP1H;
	__IO uint32_t CCAP1L;
	__IO uint32_t CCAP2H;
	__IO uint32_t CCAP2L;
	__IO uint32_t CCAP3H;
	__IO uint32_t CCAP3L;
	__IO uint32_t CCAP4H;
	__IO uint32_t CCAP4L;
	__IO uint32_t CCAPO;
	__IO uint32_t CCAP0;
	__IO uint32_t CCAP1;
	__IO uint32_t CCAP2;
	__IO uint32_t CCAP3;
	__IO uint32_t CCAP4;
}PCA_REG_TypeDef;

#define L005_PCA             ((PCA_REG_TypeDef *)PCA_BASEADDR)

/*  **********   RTC struct    **********  */

typedef struct
{
	__IO uint32_t PRDS			: 3;
	__IO uint32_t AMPM			: 1;
	__IO uint32_t RESERVED	    : 1;
	__IO uint32_t HZ1OE	    	: 1;
	__IO uint32_t HZ1SEL	    : 1;
	__IO uint32_t START			: 1;
	__IO uint32_t PRDX          : 6;
	__IO uint32_t PRDSEL        : 1;
	__IO uint32_t RERSEVED1     : 17;
}rtc_cr0_field_t;

typedef struct
{
	__IO uint32_t WAIT			  : 1;
	__IO uint32_t WAITF           :	1;
	__IO uint32_t RESERVED	      : 1;
	__IO uint32_t PRDF			  :	1;
	__IO uint32_t ALMF			  :	1;
	__IO uint32_t RERSEVED1       : 1;
	__IO uint32_t ALMIE 		  :	1;
	__IO uint32_t ALMEN			  : 1;
	__IO uint32_t CKSEL			  : 3;
	__IO uint32_t RERSEVED2       : 21;
}rtc_cr1_field_t;

typedef struct
{
	__IO uint32_t SECL	   : 4;
	__IO uint32_t SECH	   : 3;
	__IO uint32_t RESERVED : 25;

}rtc_sec_field_t;

typedef struct
{
	__IO uint32_t MINL	   : 4;
	__IO uint32_t MINH 	   : 3;
	__IO uint32_t RESERVED : 25;
}rtc_min_field_t;

typedef struct
{
	__IO uint32_t HOURL	   : 4;
	__IO uint32_t HOURH	   : 2;
	__IO uint32_t RESERVED : 26;
}rtc_hour_field_t;

typedef struct
{
	__IO uint32_t DAYL	   : 4;
	__IO uint32_t DAYH	   : 2;
	__IO uint32_t RESERVED : 26;
}rtc_day_field_t;

typedef struct
{
	__IO uint32_t WEEK     : 3;
	__IO uint32_t RESERVED : 29;
}rtc_week_field_t;

typedef struct
{
	__IO uint32_t MON	    : 5;
	__IO uint32_t RESERVED	: 27;
}rtc_mon_field_t;

typedef struct
{
	__IO uint32_t YEARL	   : 4;
	__IO uint32_t YEARH	   : 4;
	__IO uint32_t RESERVED : 24;
}rtc_year_field_t;

typedef struct
{
	__IO uint32_t ALMMINL	: 4;
	__IO uint32_t ALMMINH	: 3;
	__IO uint32_t RESERVED  : 25; 
}rtc_almmin_field_t;

typedef struct
{
	__IO uint32_t ALMHOURL	: 4;
	__IO uint32_t ALMHOURH	: 2;
	__IO uint32_t RESERVED  : 26;
}rtc_almhour_field_t;

typedef struct  
{
	__IO uint32_t ALMWEEK   : 7;
	__IO uint32_t RERSEVED  : 25;
}rtc_almweek_field_t;

typedef struct
{
	__IO uint32_t CR		: 9;
	__IO uint32_t RESERVED	: 6;
	__IO uint32_t EN		: 1;
	__IO uint32_t RERSEVED1 : 16;
}rtc_compen_field_t;

typedef struct
{
	union {
		__IO uint32_t CR0;
		rtc_cr0_field_t CR0_f;
	};
	
	union {
		__IO uint32_t CR1;
		rtc_cr1_field_t	CR1_f;
	};
	
	union {
		__IO uint32_t SEC;
		rtc_sec_field_t SEC_f;
	};
	
	union {
		__IO uint32_t MIN;
		rtc_min_field_t	MIN_f;
	};
	
	union {
		__IO uint32_t HOUR;
		rtc_hour_field_t HOUR_f;
	};
	
	union {
		__IO uint32_t WEEK;
		rtc_week_field_t WEEK_f;
	};
	
	union {
		__IO uint32_t DAY;
		rtc_day_field_t DAY_f;
	};
	
	union {
		__IO uint32_t MON;
		rtc_mon_field_t MON_f;
	};

	union {
		__IO uint32_t YEAR;
		rtc_year_field_t YEAR_f;
	};
	
	union {
		__IO uint32_t ALMMIN;
		rtc_almmin_field_t ALMMIN_f;
	};
	
	union {
		__IO uint32_t ALMHOUR;
		rtc_almhour_field_t ALMHOUR_f;
	};
	
	union {
		__IO uint32_t ALMWEEK;
		rtc_almweek_field_t ALMWEEK_f;
	};
	
	union {
		__IO uint32_t COMPEN;
		rtc_compen_field_t COMPEN_f;
	};
}RTC_REG_TypeDef;

#define L005_RTC				 			((RTC_REG_TypeDef *)RTC_BASEADDR)


