havenxie/HC32Lxx-FirmWare/HC32L110Code_Lib/lib/inc/hc32lxx.h
/*  **********   CLK_TRIM struct    **********  */

typedef struct
{
  __IO uint32_t trim_star      : 1;
  __IO uint32_t refclk_sel     : 3;   
  __IO uint32_t calclk_sel     : 2;   
  __IO uint32_t mon_en         : 1;
  __IO uint32_t IE             : 1;
  __IO uint32_t RERSEVED       : 24;         
}clk_trim_trimcon_field_t; 

typedef struct
{
  __IO uint32_t stop           : 1;         
  __IO uint32_t calcnt_of      : 1;         
  __IO uint32_t xtal32k_fault  : 1;   
  __IO uint32_t xtal32m_fault  : 1;   
  __IO uint32_t RERSEVED       : 28;         
}clk_trim_trimflg_field_t; 

typedef struct
{
  __IO uint32_t stop_clr           : 1;         
  __IO uint32_t calcnt_off_clr     : 1;   
  __IO uint32_t xtal32k_fault_clr  : 1;   
  __IO uint32_t xtal32m_fault_clr  : 1;
  __IO uint32_t RERSEVED           : 28;         
}clk_trim_trimclr_field_t; 

typedef struct
{
  union {
      __IO  uint32_t CR;
      clk_trim_trimcon_field_t CR_f;
  };

  __IO  uint32_t REFCON;
  __IO  uint32_t REFCNT;
  __IO  uint32_t CALCNT;  
  
  union {
	  __IO  uint32_t IFR;
      clk_trim_trimflg_field_t IFR_f;
  };
  
  union {
	  __IO  uint32_t ICLR;
      clk_trim_trimclr_field_t ICLR_f;
  };
  __IO  uint32_t CALCON;
}CLK_TRIM_REG_TypeDef;

#define L005_CLKTRIM     ((CLK_TRIM_REG_TypeDef *)CLK_TRIM_BASEADDR)


/*  **********   SYS_CTRL struct    **********  */

typedef struct
{
	__IO uint32_t RCH_EN       		: 1;
	__IO uint32_t XTH_EN           	: 1;
	__IO uint32_t RCL_EN       		: 1;
	__IO uint32_t XTL_EN         	: 1;	
	__IO uint32_t Clk_sw4_sel       : 2;		
	__IO uint32_t HCLK_PRS          : 3;		
	__IO uint32_t PCLK_PRS          : 2;		
	__IO uint32_t RERSEVED          : 4;	
	__IO uint32_t wakeup_byRCH   	: 1;	
	__IO uint32_t RERSEVED1         : 16;	
}sysctrl0_field_t;

typedef struct
{
	__IO uint32_t RERSEVED0             : 1;	
	__IO uint32_t EXTH_EN 	            : 1;	
	__IO uint32_t EXTL_EN 	            : 1;	
	__IO uint32_t XTL_ALWAYS_ON 	    : 1;	
	__IO uint32_t CLOCK_FAULT_EN        : 1;	
	__IO uint32_t RTC_LPW               : 1;	
	__IO uint32_t LOCKUP_EN             : 1;	
	__IO uint32_t RESET_USE_IO          : 1;	
	__IO uint32_t SWD_USE_IO            : 1;	
	__IO uint32_t RTC_FREQ_ADJUST       : 3;	
	__IO uint32_t FLASH_PARA_AUTOADJUST : 1;	
	__IO uint32_t RERSEVED1             : 19;	
}sysctrl1_field_t;

//typedef struct
//{
//	__IO uint32_t LOCK               : 1;
//	__IO uint32_t RERSEVED           : 31;	
//}sysctrl2_field_t;

typedef struct
{
	__IO uint32_t TRIM           : 9;
	__IO uint32_t FSEL           : 2;
	__IO uint32_t stable         : 1;	
	__IO uint32_t RERSEVED       : 20;		
}RCH_CR_field_t;

typedef struct
{
	__IO uint32_t Driver         : 4;
	__IO uint32_t Startup        : 2;	
	__IO uint32_t stable         : 1;	
	__IO uint32_t RERSEVED       : 25;		
}XTH_CR_field_t;

typedef struct
{
	__IO uint32_t TRIM           : 9;
	__IO uint32_t FSEL           : 1;
	__IO uint32_t Startup        : 2;	
	__IO uint32_t stable         : 1;	
	__IO uint32_t RERSEVED       : 19;		
}RCL_CR_field_t;

typedef struct
{
	__IO uint32_t Driver         : 4;
	__IO uint32_t Startup        : 2;	
	__IO uint32_t stable         : 1;	
	__IO uint32_t RERSEVED       : 25;		
}XTL_CR_field_t;

typedef struct
{
	__IO uint32_t POR5V              : 1;
	__IO uint32_t POR15V             : 1;
	__IO uint32_t LVD            : 1;
	__IO uint32_t WDT            : 1;
	__IO uint32_t PCA            : 1;
	__IO uint32_t Lockup         : 1;
	__IO uint32_t Sysreq         : 1;
	__IO uint32_t RSTB               : 1;
//	__IO uint32_t fLASH_OVERFLOW     : 1;
//	__IO uint32_t RERSEVED           : 23;		
	__IO uint32_t RERSEVED           : 24;		
}Reset_flag_field_t;

typedef struct
{
  __IO uint32_t UART0              : 1;   
  __IO uint32_t UART1              : 1;   
  __IO uint32_t LPUART             : 1;   
  __IO uint32_t RERSEVED0          : 1;   
  __IO uint32_t I2C                : 1;   
  __IO uint32_t RERSEVED1          : 1;   
  __IO uint32_t SPI                : 1;   
  __IO uint32_t RERSEVED2          : 1;   
  __IO uint32_t BASETIM            : 1;   
  __IO uint32_t LPTIM              : 1;   
  __IO uint32_t ADVTIM             : 1;   
  __IO uint32_t RERSEVED3          : 3;   
  __IO uint32_t PCA                : 1;   
  __IO uint32_t WDT                : 1;   
  __IO uint32_t ADC                : 1;   
  __IO uint32_t VC                 : 1;   
  __IO uint32_t RERSEVED4          : 2;   
  __IO uint32_t RTC                : 1;   
  __IO uint32_t clk_trim           : 1;  
  __IO uint32_t RERSEVED5          : 2;   
  //__IO uint32_t BOOT               : 1;  
  __IO uint32_t SYSTICK            : 1;  
  __IO uint32_t SWD                : 1;  
  __IO uint32_t CRC                : 1;  
  __IO uint32_t RERSEVED6          : 1;   
  __IO uint32_t GPIO               : 1;  
  __IO uint32_t RERSEVED7          : 2;   
  //__IO uint32_t RAM                : 1;  
  __IO uint32_t FLASH              : 1;  
}PERI_CLKEN_field_t;     

typedef struct
{
  __IO uint32_t UART0              : 1;   
  __IO uint32_t UART1              : 1;   
  __IO uint32_t LPUART             : 1;   
  __IO uint32_t RERSEVED0          : 1;   
  __IO uint32_t I2C                : 1;   
  __IO uint32_t RERSEVED1          : 1;   
  __IO uint32_t SPI                : 1;   
  __IO uint32_t RERSEVED2          : 1;   
  __IO uint32_t BASETIM            : 1;   
  __IO uint32_t LPTIM              : 1;   
  __IO uint32_t ADVTIM             : 1;   
  __IO uint32_t RERSEVED3          : 3;   
  __IO uint32_t PCA                : 1;   
  __IO uint32_t WDT                : 1;   
  __IO uint32_t ADC                : 1;   
  __IO uint32_t VC                 : 1;   
  __IO uint32_t RERSEVED4          : 2;   
  __IO uint32_t RTC                : 1;   
  __IO uint32_t Trim               : 1;  
  __IO uint32_t RERSEVED5          : 2;   
  //__IO uint32_t RERSEVED8          : 1;   
  __IO uint32_t SYSTICK            : 1;  
  __IO uint32_t SWD                : 1;  
  __IO uint32_t CRC                : 1;  
  __IO uint32_t RERSEVED6          : 1;   
  __IO uint32_t GPIO               : 1;  
  __IO uint32_t RERSEVED7          : 2;   
  //__IO uint32_t RAM                : 1;  
  __IO uint32_t FLASH              : 1;  
}PREI_RESET_field_t;

typedef struct
{
  __IO uint32_t STCALIB             : 24;   
  __IO uint32_t SKEW                : 1;  
  __IO uint32_t NOREF               : 1;  
  __IO uint32_t CLK_SEL             : 2;  
  __IO uint32_t RERSEVED            : 4;		
}SYSTICK_CR_field_t;

typedef struct
{
  __IO uint32_t P0                  : 1;   
  __IO uint32_t P1                  : 1;   
  __IO uint32_t P2                  : 1;   
  __IO uint32_t P3                  : 1;   
  __IO uint32_t LPUART              : 1;   
  __IO uint32_t LPTIM               : 1;   
  __IO uint32_t WDT                 : 1;   
  __IO uint32_t RTC                 : 1;   
  __IO uint32_t VC0                 : 1;   
  __IO uint32_t VC1                 : 1;   
  __IO uint32_t LVD                 : 1;  
  __IO uint32_t CLK_FAULT           : 1;  
  __IO uint32_t Wakep_dpsp_mode     : 1;   
  __IO uint32_t RERSEVED            : 19;		
}wakeup_dpsp_field_t;

typedef struct
{
  __IO uint32_t TIM0                : 1;   
  __IO uint32_t TIM1                : 1;   
  __IO uint32_t TIM2                : 1;   
  __IO uint32_t LPTIM               : 1;   
  __IO uint32_t TIM4                : 1;   
  __IO uint32_t TIM5                : 1;   
  __IO uint32_t TIM6                : 1;   
  __IO uint32_t PCA                 : 1;   
  __IO uint32_t WDT                 : 1;   
  __IO uint32_t RTC                 : 1;   
//  __IO uint32_t CLK_TRIM            : 1;   
  __IO uint32_t TICK                : 1;   
  __IO uint32_t RERSEVED            : 21;  
}debug_active_field_t;

typedef struct
{
  __IO uint32_t RCH_stable_sel       : 3;   
  __IO uint32_t auto_switch_lpm      : 1;  
  __IO uint32_t CFG_RAM              : 2;  
  __IO uint32_t CFG_flash            : 2;  
  __IO uint32_t swd_enable           : 1;  
  __IO uint32_t RTC_XTL_enable       : 1;  
  __IO uint32_t debug_en             : 1;  
  __IO uint32_t fix_resetpad         : 1;  
  __IO uint32_t Test_adc             : 1;  
  __IO uint32_t XTL_STARTUP_EN       : 1;  
  __IO uint32_t XTH_STARTUP_EN       : 1;    
  __IO uint32_t RERSEVED0            : 17;		
}boot0_field_t;

typedef struct
{
  __IO uint32_t XTL_TEST            : 6;   
  __IO uint32_t XTH_TEST            : 6;  
  __IO uint32_t RCL                 : 2;  
  __IO uint32_t RCH_TEST            : 2;  
  __IO uint32_t RCH_ITC             : 4;  
  __IO uint32_t RCH_ns_enb          : 1;  
  __IO uint32_t XTH_ns_enb          : 1;  
  __IO uint32_t RCL_ns_enb          : 1;  
  __IO uint32_t XTL_ns_enb          : 1;  
  __IO uint32_t RERSEVED            : 8;		
}boot1_field_t;

typedef struct
{
  __IO uint32_t Security            : 8;   
  __IO uint32_t RERSEVED            : 24;		
}security_byte_field_t;

typedef struct 
{
	union {
		__IO uint32_t SYSCTRL0;
		sysctrl0_field_t SYSCTRL0_f;
	};
	union {
		__IO uint32_t SYSCTRL1;
		sysctrl1_field_t SYSCTRL1_f;
	};
	__IO uint32_t SYSCTRL2;
	union {
		__IO uint32_t RCH_CR;
		RCH_CR_field_t RCH_CR_f;
	};
	union {
		__IO uint32_t XTH_CR;
		XTH_CR_field_t XTH_CR_f;
	};	
	union {
		__IO uint32_t RCL_CR;
		RCL_CR_field_t RCL_CR_f;
	};
	union {
		__IO uint32_t XTL_CR;
		XTL_CR_field_t XTL_CR_f;
	};
	union {
		__IO uint32_t Reset_flag;
		Reset_flag_field_t Reset_flag_f;
	};
	union {
		__IO uint32_t PERI_CLKEN;
		PERI_CLKEN_field_t PERI_CLKEN_f;
	};	
	__IO uint32_t RESERVED0;
	union {
		__IO uint32_t PREI_RESET;
    PREI_RESET_field_t PREI_RESET_f;
	};	
	__IO uint32_t RESERVED1;
	union {
		__IO uint32_t WAKEUP_DPSP;
    wakeup_dpsp_field_t WAKEUP_DPSP_f;
	};	
	union {
		__IO uint32_t SYSTICK_CR;
    SYSTICK_CR_field_t SYSTICK_CR_f;
	};	
	union {
		__IO uint32_t DEBUG_ACTIVE;
    debug_active_field_t DEBUG_ACTIVE_f;
	};	
	__IO uint32_t RESERVED2;
	__IO uint32_t LOCKSFR;
	union {
		__IO uint32_t BOOT0;
		boot0_field_t BOOT0_f;
	};
	union {
		__IO uint32_t BOOT1;
		boot1_field_t BOOT1_f;
	};
	__IO uint32_t REMAP;
	union {
		__IO uint32_t SECURITY_BYTE;
		security_byte_field_t SECURITY_BYTE_f;
	};
}SYSTEM_CTRL_REG_TypeDef;

//#define SYSTEM_CTRL_BASEADDR (0x40002000) 
#define L005_SystemCtrl		((SYSTEM_CTRL_REG_TypeDef *)SYSTEM_CTRL_BASEADDR)


/*  ***********   PMU struct  ***********  */

