havenxie/HC32Lxx-FirmWare/HC32L110Code_Lib/lib/inc/hc32lxx.h
typedef struct{
	__IO uint32_t TRIM_V1P5   : 7;
	__IO uint32_t BIAS_SEL    : 6;	
	__IO uint32_t RERSEVED    : 19;
}pmu_field_t;

typedef struct
{
	union {
		__IO uint32_t PMU;
		pmu_field_t PMU_f;
	};	
}PMU_REG_TypeDef;

#define L005_PMU                ((PMU_REG_TypeDef *)(ANALOGCTRL_BASEADDR+0x74))


/*  ***********   BGR struct  ***********  */

typedef struct{
	__IO uint32_t BGR_EN      : 1;
	__IO uint32_t TS_EN       : 1;	
	__IO uint32_t RERSEVED    : 30;
}bgr_cr_field_t;

typedef struct{
	__IO uint32_t BGR_TRIM    : 6;
	__IO uint32_t BGR_TEST    : 1;	
	__IO uint32_t RERSEVED    : 25;
}bgr_option_field_t;

typedef struct
{
	union {
		__IO uint32_t CR;
		bgr_cr_field_t CR_f;
	};

	__IO uint32_t RESERVED[29];

	union {
		__IO uint32_t option;
		bgr_option_field_t option_f;
	};
	
}BGR_REG_TypeDef;

#define L005_BGR                ((BGR_REG_TypeDef *)ANALOGCTRL_BASEADDR)


/*  ***********   LVD struct  ***********  */
typedef struct{	
	__IO uint32_t LVDEN                    : 1;			
	__IO uint32_t Sel_rst                  : 1;		
	__IO uint32_t Source_sel               : 2;		
	__IO uint32_t LEVEL                    : 4;	
	__IO uint32_t FLTEN                    : 1;		
	__IO uint32_t Debounce_time            : 3;		
	__IO uint32_t Falling                  : 1;		
	__IO uint32_t Rising                   : 1;		
	__IO uint32_t Level                    : 1;		
	__IO uint32_t IE                       : 1;
	__IO uint32_t RERSEVED                 : 16;
}lvd_cr_field_t;

typedef struct{
	__IO uint32_t INTF                     : 1;		
	__IO uint32_t RERSEVED                 : 31;	
}lvd_ifr_field_t;

typedef struct
{
	union {
		__IO uint32_t CR;
		lvd_cr_field_t CR_f;
	};	
	
	union {
		__IO uint32_t IFR;
		lvd_ifr_field_t IFR_f;
	};	
}LVD_REG_TypeDef;

#define L005_LVD                ((LVD_REG_TypeDef *)(ANALOGCTRL_BASEADDR+0x28))


/*  ***********   VC struct   ***********  */
typedef struct{	
	__IO uint32_t VC_DIV                   : 6;		
	__IO uint32_t VC_DIV_EN                : 1;
	__IO uint32_t VC_REF2P5_SEL            : 1;
	__IO uint32_t VC0_BIAS_SEL             : 2;
	__IO uint32_t VC0_HYS_SEL              : 2;
	__IO uint32_t VC1_BIAS_SEL             : 2;
	__IO uint32_t VC1_HYS_SEL              : 2;	
	__IO uint32_t RERSEVED                 : 16;
}vc_cr_field_t;

typedef struct{	
	__IO uint32_t EN                       : 1;		
	__IO uint32_t p_sel                    : 3;
	__IO uint32_t n_sel                    : 4;
	__IO uint32_t FLTEN                    : 1;	
	__IO uint32_t debounce_time            : 3;		
	__IO uint32_t falling                  : 1;
	__IO uint32_t rising                   : 1;
	__IO uint32_t level                    : 1;
	__IO uint32_t IE                       : 1;		
	__IO uint32_t RERSEVED                 : 16;
}vc0_cr_field_t;

typedef struct{	
	__IO uint32_t EN                       : 1;		
	__IO uint32_t p_sel                    : 3;
	__IO uint32_t n_sel                    : 4;
	__IO uint32_t FLTEN                    : 1;	
	__IO uint32_t debounce_time            : 3;	
	__IO uint32_t falling                  : 1;
	__IO uint32_t rising                   : 1;
	__IO uint32_t level                    : 1;	
	__IO uint32_t IE                       : 1;		
	__IO uint32_t RERSEVED                 : 16;
}vc1_cr_field_t;

typedef struct{	
	__IO uint32_t INV_Timer                : 1;		
	__IO uint32_t TM0G                     : 1;	
	__IO uint32_t TM1G                     : 1;		
	__IO uint32_t TM2G                     : 1;		
	__IO uint32_t TM3G                     : 1;	
	__IO uint32_t TM3ECLK                  : 1;		
	__IO uint32_t INV_PCA                  : 1;		
	__IO uint32_t PCACAP0                  : 1;		
	__IO uint32_t PCAECI                   : 1;		
	__IO uint32_t Inv_TIM4                 : 1;	
	__IO uint32_t TIM4                     : 1;		
	__IO uint32_t Inv_TIM5                 : 1;	
	__IO uint32_t TIM5                     : 1;	
	__IO uint32_t inv_TIM6                 : 1;	
	__IO uint32_t TIM6                     : 1;		
	__IO uint32_t brake                    : 1;	
	__IO uint32_t RERSEVED                 : 16;
}vc0_out_cfg_field_t;

typedef struct{	
	__IO uint32_t INV_Timer                : 1;		
	__IO uint32_t TM0G                     : 1;	
	__IO uint32_t TM1G                     : 1;		
	__IO uint32_t TM2G                     : 1;		
	__IO uint32_t TM3G                     : 1;	
	__IO uint32_t TM3ECLK                  : 1;		
	__IO uint32_t INV_PCA                  : 1;		
	__IO uint32_t PCACAP0                  : 1;		
	__IO uint32_t PCAECI                   : 1;		
	__IO uint32_t Inv_TIM4                 : 1;	
	__IO uint32_t TIM4                     : 1;		
	__IO uint32_t Inv_TIM5                 : 1;	
	__IO uint32_t TIM5                     : 1;	
	__IO uint32_t inv_TIM6                 : 1;	
	__IO uint32_t TIM6                     : 1;		
	__IO uint32_t brake                    : 1;	
	__IO uint32_t RERSEVED                 : 16;
}vc1_out_cfg_field_t;

typedef struct{
	__IO uint32_t VC0_INTF                 : 1;
	__IO uint32_t VC1_INTF                 : 1;		
	__IO uint32_t VC0_filter               : 1;		
	__IO uint32_t VC1_filter               : 1;	
	__IO uint32_t RERSEVED                 : 28;
}vc_int_field_t;

typedef struct
{
	union {
		__IO uint32_t CR;
		vc_cr_field_t CR_f;
	};

	union {
		__IO uint32_t VC0_CR;
		vc0_cr_field_t VC0_CR_f;
	};

	union {
		__IO uint32_t VC1_CR;
		vc1_cr_field_t VC1_CR_f;
	};
	
	union {
		__IO uint32_t VC0_OUT_CFG;
		vc0_out_cfg_field_t VC0_OUT_CFG_f;
	};	
	
	union {
		__IO uint32_t VC1_OUT_CFG;
		vc1_out_cfg_field_t VC1_OUT_CFG_f;
	};	

	union {
		__IO uint32_t INT;
		vc_int_field_t INT_f;
	};		
}VC_REG_TypeDef;

#define L005_VC                 ((VC_REG_TypeDef *)(ANALOGCTRL_BASEADDR+0X10))



/*  ***********   ADC struct  ***********  */
typedef struct{
	__IO uint32_t ADCEN         : 1;		
	__IO uint32_t START         : 1;		
	__IO uint32_t CLKSEL        : 2;		
	__IO uint32_t SEL           : 4;		
	__IO uint32_t SREF          : 2;		
	__IO uint32_t BUFEN         : 1;	
	__IO uint32_t SAM           : 2;
	__IO uint32_t RERSEVED      : 1;
	__IO uint32_t IE            : 1;	
	__IO uint32_t RERSEVED1     : 17;
}adccr0_field_t;

