havenxie/HC32Lxx-FirmWare/HC32L110Code_Lib/lib/inc/hc32lxx.h
typedef struct{
	__IO uint32_t TRIGS0                  : 5;		
	__IO uint32_t TRIGS1                  : 5;		
	__IO uint32_t CT                      : 1;		
	__IO uint32_t RACC_EN                 : 1;		
	__IO uint32_t LLT_IE                  : 1;		
	__IO uint32_t HHT_IE                  : 1;
	__IO uint32_t REG_IE                  : 1;	
	__IO uint32_t RACC_CLR                : 1;
	__IO uint32_t RERSEVED                : 16;
}adccr1_field_t;

typedef struct{	
	__IO uint32_t CH0EN                    : 1;		
	__IO uint32_t CH1EN                    : 1;
	__IO uint32_t CH2EN                    : 1;
	__IO uint32_t CH3EN                    : 1;
	__IO uint32_t CH4EN                    : 1;
	__IO uint32_t CH5EN                    : 1;
	__IO uint32_t CH6EN                    : 1;
	__IO uint32_t CH7EN                    : 1;
	__IO uint32_t ADCCNT                   : 8;		
	__IO uint32_t RERSEVED                 : 16;
}adccr2_field_t;

typedef struct{
	__IO uint32_t LLT_INTF                 : 1;
	__IO uint32_t HHT_INTF                 : 1;	
	__IO uint32_t REG_INTF                 : 1;	
	__IO uint32_t CONT_INTF                : 1;	
	__IO uint32_t RERSEVED                 : 28;
}adc_int_field_t;

typedef struct{
	__IO uint32_t LLT_INTC                 : 1;
	__IO uint32_t HHT_INTC                 : 1;	
	__IO uint32_t REG_INTC                 : 1;	
	__IO uint32_t CONT_INTC                : 1;	
	__IO uint32_t RERSEVED                 : 28;
}adc_int_clr_field_t;

typedef struct{	
	__IO uint32_t ADC_OPT2P5               : 4;		
	__IO uint32_t ADC_OPT1P5               : 4;
	__IO uint32_t ADC_CLK_Delay            : 3;
	__IO uint32_t VCM_S                    : 2;
	__IO uint32_t PRE_S                    : 2;
	__IO uint32_t Vreftrim                 : 1;	
	__IO uint32_t ADC_CLK_SEL_EXT          : 1;
	__IO uint32_t ADC_CLK_S                : 1;
	__IO uint32_t ADC_CLK_TEST             : 1;
	__IO uint32_t RERSEVED                 : 13;
}adccr3_field_t;

typedef struct
{
	__IO uint32_t RERSEVED;
	
	union {
		__IO uint32_t CR0;
		adccr0_field_t CR0_f;
	};		
	
	union {
		__IO uint32_t CR1;
		adccr1_field_t CR1_f;
	};		
	
	union {
		__IO uint32_t CR2;
		adccr2_field_t CR2_f;
	};	

	__IO uint32_t RERSEVED1[8];
	__IO uint32_t result0;
	__IO uint32_t result1;
	__IO uint32_t result2;
	__IO uint32_t result3;
	__IO uint32_t result4;
	__IO uint32_t result5;
	__IO uint32_t result6;
	__IO uint32_t result7;
	__IO uint32_t result8;
	__IO uint32_t result_acc;
	__IO uint32_t HT;
	__IO uint32_t LT;	
	
	union {
		__IO uint32_t IFR;
		adc_int_field_t IFR_f;
	};	

	union {
		__IO uint32_t ICLR;
		adc_int_clr_field_t ICLR_f;
	};	

	__IO uint32_t result;
	__IO uint32_t RESERVED2;

	union {
		__IO uint32_t CR3;
		adccr3_field_t CR3_f;
	};	

}ADC_REG_TypeDef;


#define L005_ADC                ((ADC_REG_TypeDef *)ANALOGCTRL_BASEADDR)

/*  **********   TIMER6 struct    **********  */

typedef struct
{
	__IO uint32_t START      : 1;
	__IO uint32_t MODE       : 3;
	__IO uint32_t CKDIV      : 3;
	__IO uint32_t RERSEVED   : 1;	
	__IO uint32_t DIR        : 1;
	__IO uint32_t RERSEVED1  : 7;	
	__IO uint32_t ZMSKREV    : 1; 
	__IO uint32_t ZMSKPOS    : 1; 
	__IO uint32_t ZMSK       : 2; 
	__IO uint32_t RERSEVED3  : 12; 	

}tim6_gconr_field_t;	

typedef struct
{
	__IO uint32_t INTENA      : 1;
	__IO uint32_t INTENB      : 1;
	__IO uint32_t INTENC      : 1;
	__IO uint32_t INTEND      : 1;
	__IO uint32_t RERSEVED    : 2;	
	__IO uint32_t INTENOVF    : 1;//add @1207
	__IO uint32_t INTENUDF    : 1;//add @1207
	__IO uint32_t INTENDE     : 1;
	__IO uint32_t RERSEVED1   : 23;	
}tim6_iconr_field_t;	
typedef struct
{
	__IO uint32_t CAPCA      : 1;
	__IO uint32_t STACA      : 1;
	__IO uint32_t STPCA      : 1;
	__IO uint32_t STASTPSA   : 1;
	__IO uint32_t CMPCA      : 2;
	__IO uint32_t PERCA      : 2;
	__IO uint32_t OUTENA     : 1;
	__IO uint32_t DISSELA    : 2;
	__IO uint32_t DISVALA    : 2;
	__IO uint32_t RERSEVED   : 3;
	__IO uint32_t CAPCB      : 1;
	__IO uint32_t STACB      : 1;
	__IO uint32_t STPCB      : 1;
	__IO uint32_t STASTPSB   : 1;
	__IO uint32_t CMPCB      : 2;
	__IO uint32_t PERCB      : 2;
	__IO uint32_t OUTENB     : 1;
	__IO uint32_t DISSELB    : 2;
	__IO uint32_t DISVALB    : 2;
	__IO uint32_t RERSEVED1  : 3;
}tim6_pconr_field_t;	
typedef struct
{
	__IO uint32_t BENA      : 1;
	__IO uint32_t RERSEVED1 : 1;
	__IO uint32_t BENB      : 1;
	__IO uint32_t RERSEVED2 : 5;
	__IO uint32_t BENP      : 1;
	__IO uint32_t RERSEVED3 : 23;	
}tim6_bconr_field_t;	
typedef struct
{
	__IO uint32_t DTCEN      : 1;
	__IO uint32_t RERSEVED   : 7;		//add @1207
	__IO uint32_t SEPA       : 1;	
	__IO uint32_t RERSEVED1  : 23;	
}tim6_dconr_field_t;	
typedef struct
{
	__IO uint32_t RERSEVED1  : 32;	
}tim6_cconr_field_t;	
typedef struct
{
	__IO uint32_t NOFIENGA   : 1;	//add @1207..
	__IO uint32_t NOFICKGA   : 2;
	__IO uint32_t RERSEVED1  : 1;

	__IO uint32_t NOFIENGB   : 1;	//add @1207..
	__IO uint32_t NOFICKGB   : 2;

	__IO uint32_t RERSEVED2  : 9;	

	__IO uint32_t NOFIENTA   : 1;	//add @1207..
	__IO uint32_t NOFICKTA   : 2;
	__IO uint32_t RERSEVED3  : 1;	
	__IO uint32_t NOFIENTB   : 1;	//add @1207..
	__IO uint32_t NOFICKTB   : 2;
	__IO uint32_t RERSEVED4  : 1;	

	__IO uint32_t NOFIENTC   : 1;	//add @1207..
	__IO uint32_t NOFICKTC   : 2;
	__IO uint32_t RERSEVED5  : 1;	
	__IO uint32_t NOFIENTD   : 1;	//add @1207..
	__IO uint32_t NOFICKTD   : 2;
	__IO uint32_t RERSEVED6  : 1;		
	
}tim6_fconr_field_t;	
typedef struct
{
	__IO uint32_t GEPERIA   : 1;
	__IO uint32_t GEPERIB   : 1;	
	__IO uint32_t GEPERIC   : 1;
	__IO uint32_t GEPERID   : 1;
	__IO uint32_t RERSEVED  : 12;
	__IO uint32_t PCNTE     : 2;
	__IO uint32_t PCNTS     : 3;
	__IO uint32_t RERSEVED2 : 11;
}tim6_vperr_field_t;	
typedef struct
{
	__IO uint32_t CMAF       : 1;
	__IO uint32_t CMBF       : 1;
	__IO uint32_t CMCF       : 1;
	__IO uint32_t CMDF       : 1;
	__IO uint32_t RERSEVED   : 2;	
	__IO uint32_t OVFF       : 1;
	__IO uint32_t UDFF       : 1;
	__IO uint32_t DTEF       : 1;
	__IO uint32_t RERSEVED1  : 12;		
	__IO uint32_t VPERNUM    : 3;	//ADD @1207
	__IO uint32_t RERSEVED2  : 7;		
	__IO uint32_t DIRF       : 1;	
}tim6_stflr_field_t;	
typedef struct
{
	__IO uint32_t HSTA0      : 1;
	__IO uint32_t HSTA1      : 1;
	__IO uint32_t HSTA2      : 1;
	__IO uint32_t HSTA3      : 1;
	__IO uint32_t HSTA4      : 1;
	__IO uint32_t HSTA5      : 1;
	__IO uint32_t HSTA6      : 1;
	__IO uint32_t HSTA7      : 1;
	__IO uint32_t HSTA8      : 1;
	__IO uint32_t HSTA9      : 1;
	__IO uint32_t HSTA10     : 1;
	__IO uint32_t HSTA11     : 1;
	__IO uint32_t HSTA12     : 1;
	__IO uint32_t HSTA13     : 1;
	__IO uint32_t HSTA14     : 1;
	__IO uint32_t HSTA15     : 1;
	__IO uint32_t RERSEVED   : 15;	
	__IO uint32_t STARTS     : 1;
}tim6_hstar_field_t;	
typedef struct
{
	__IO uint32_t HSTP0      : 1;
	__IO uint32_t HSTP1      : 1;
	__IO uint32_t HSTP2      : 1;
	__IO uint32_t HSTP3      : 1;
	__IO uint32_t HSTP4      : 1;
	__IO uint32_t HSTP5      : 1;
	__IO uint32_t HSTP6      : 1;
	__IO uint32_t HSTP7      : 1;
	__IO uint32_t HSTP8      : 1;
	__IO uint32_t HSTP9      : 1;
	__IO uint32_t HSTP10     : 1;
	__IO uint32_t HSTP11     : 1;
	__IO uint32_t HSTP12     : 1;
	__IO uint32_t HSTP13     : 1;
	__IO uint32_t HSTP14     : 1;
	__IO uint32_t HSTP15     : 1;
	__IO uint32_t RERSEVED   : 15;	
	__IO uint32_t STOPS      : 1;
}tim6_hstpr_field_t;	
typedef struct
{
	__IO uint32_t HCLE0      : 1;
	__IO uint32_t HCLE1      : 1;
	__IO uint32_t HCLE2      : 1;
	__IO uint32_t HCLE3      : 1;
	__IO uint32_t HCLE4      : 1;
	__IO uint32_t HCLE5      : 1;
	__IO uint32_t HCLE6      : 1;
	__IO uint32_t HCLE7      : 1;
	__IO uint32_t HCLE8      : 1;
	__IO uint32_t HCLE9      : 1;
	__IO uint32_t HCLE10     : 1;
	__IO uint32_t HCLE11     : 1;
	__IO uint32_t HCLE12     : 1;
	__IO uint32_t HCLE13     : 1;
	__IO uint32_t HCLE14     : 1;
	__IO uint32_t HCLE15     : 1;
	//__IO uint32_t HCLE16     : 1;
	//__IO uint32_t HCLE17     : 1;
	//__IO uint32_t HCLE18     : 1;
	//__IO uint32_t HCLE19     : 1;
	__IO uint32_t RERSEVED   : 15;	
	__IO uint32_t CLEARS     : 1;
}tim6_hclrr_field_t;	
typedef struct
{
	__IO uint32_t HCPA0      : 1;
	__IO uint32_t HCPA1      : 1;
	__IO uint32_t HCPA2      : 1;
	__IO uint32_t HCPA3      : 1;
	__IO uint32_t HCPA4      : 1;
	__IO uint32_t HCPA5      : 1;
	__IO uint32_t HCPA6      : 1;
	__IO uint32_t HCPA7      : 1;
	__IO uint32_t HCPA8      : 1;
	__IO uint32_t HCPA9      : 1;
	__IO uint32_t HCPA10     : 1;
	__IO uint32_t HCPA11     : 1;
	__IO uint32_t HCPA12     : 1;
	__IO uint32_t HCPA13     : 1;
	__IO uint32_t HCPA14     : 1;
	__IO uint32_t HCPA15     : 1;
	//__IO uint32_t HCPA16     : 1;
	//__IO uint32_t HCPA17     : 1;
	//__IO uint32_t HCPA18     : 1;
	//__IO uint32_t HCPA19     : 1;
	__IO uint32_t RERSEVED   : 16;	
}tim6_hcpar_field_t;	
typedef struct
{
	__IO uint32_t HCPB0      : 1;
	__IO uint32_t HCPB1      : 1;
	__IO uint32_t HCPB2      : 1;
	__IO uint32_t HCPB3      : 1;
	__IO uint32_t HCPB4      : 1;
	__IO uint32_t HCPB5      : 1;
	__IO uint32_t HCPB6      : 1;
	__IO uint32_t HCPB7      : 1;
	__IO uint32_t HCPB8      : 1;
	__IO uint32_t HCPB9      : 1;
	__IO uint32_t HCPB10     : 1;
	__IO uint32_t HCPB11     : 1;
	__IO uint32_t HCPB12     : 1;
	__IO uint32_t HCPB13     : 1;
	__IO uint32_t HCPB14     : 1;
	__IO uint32_t HCPB15     : 1;
	//__IO uint32_t HCPB16     : 1;
	//__IO uint32_t HCPB17     : 1;
	//__IO uint32_t HCPB18     : 1;
	//__IO uint32_t HCPB19     : 1;
	__IO uint32_t RERSEVED   : 16;	
}tim6_hcpbr_field_t;	
typedef struct
{
	__IO uint32_t HCUP0      : 1;
	__IO uint32_t HCUP1      : 1;
	__IO uint32_t HCUP2      : 1;
	__IO uint32_t HCUP3      : 1;
	__IO uint32_t HCUP4      : 1;
	__IO uint32_t HCUP5      : 1;
	__IO uint32_t HCUP6      : 1;
	__IO uint32_t HCUP7      : 1;
	__IO uint32_t HCUP8      : 1;
	__IO uint32_t HCUP9      : 1;
	__IO uint32_t HCUP10     : 1;
	__IO uint32_t HCUP11     : 1;
	__IO uint32_t HCUP12     : 1;
	__IO uint32_t HCUP13     : 1;
	__IO uint32_t HCUP14     : 1;
	__IO uint32_t HCUP15     : 1;
	__IO uint32_t HCUP16     : 1;
	__IO uint32_t HCUP17     : 1;
	__IO uint32_t HCUP18     : 1;
	__IO uint32_t HCUP19     : 1;
	__IO uint32_t RERSEVED   : 12;	
}tim6_hcupr_field_t;	
typedef struct
{
	__IO uint32_t HCDO0      : 1;
	__IO uint32_t HCDO1      : 1;
	__IO uint32_t HCDO2      : 1;
	__IO uint32_t HCDO3      : 1;
	__IO uint32_t HCDO4      : 1;
	__IO uint32_t HCDO5      : 1;
	__IO uint32_t HCDO6      : 1;
	__IO uint32_t HCDO7      : 1;
	__IO uint32_t HCDO8      : 1;
	__IO uint32_t HCDO9      : 1;
	__IO uint32_t HCDO10     : 1;
	__IO uint32_t HCDO11     : 1;
	__IO uint32_t HCDO12     : 1;
	__IO uint32_t HCDO13     : 1;
	__IO uint32_t HCDO14     : 1;
	__IO uint32_t HCDO15     : 1;
	__IO uint32_t HCDO16     : 1;
	__IO uint32_t HCDO17     : 1;
	__IO uint32_t HCDO18     : 1;
	__IO uint32_t HCDO19     : 1;
	__IO uint32_t RERSEVED   : 12;	
}tim6_hcdor_field_t;	
typedef struct
{
	__IO uint32_t WP         : 1;
	__IO uint32_t RERSEVED   : 7;
	__IO uint32_t PROKEY     : 8;
	__IO uint32_t RERSEVED1  : 16;
}tim6_gpror_field_t;	
typedef struct
{
	__IO uint32_t CMAF       : 1;
	__IO uint32_t CMBF       : 1;
	__IO uint32_t CMCF       : 1;
	__IO uint32_t CMDF       : 1;
	__IO uint32_t RERSEVED   : 2;
	__IO uint32_t OVFF       : 1;
	__IO uint32_t UDFF       : 1;
	
