havenxie/HC32Lxx-FirmWare/HC32L110Code_Lib/lib/inc/hc32lxx.h
	__IO uint32_t DTEF       : 1;
	__IO uint32_t RERSEVED1  : 5;
	__IO uint32_t SAMLF      : 1;
	__IO uint32_t SAMHF      : 1;
	
	__IO uint32_t RERSEVED2  : 16;
}tim6_intfr_field_t;	
typedef struct
{
	__IO uint32_t CMAC       : 1;
	__IO uint32_t CMBC       : 1;
	__IO uint32_t CMCC       : 1;
	__IO uint32_t CMDC       : 1;
	__IO uint32_t RERSEVED   : 2;
	__IO uint32_t OVFC       : 1;
	__IO uint32_t UDFC       : 1;
	
	__IO uint32_t DTEC       : 1;
	__IO uint32_t RERSEVED1  : 5;
	__IO uint32_t SAMLC      : 1;
	__IO uint32_t SAMHC      : 1;
	
	__IO uint32_t RERSEVED2  : 16;
}tim6_intcr_field_t;	
typedef struct
{
	__IO uint32_t CMAE       : 1;
	__IO uint32_t CMBE       : 1;
	__IO uint32_t CMCE       : 1;
	__IO uint32_t CMDE       : 1;
	__IO uint32_t RERSEVED   : 2;
	__IO uint32_t OVFE       : 1;
	__IO uint32_t UDFE       : 1;
	
	__IO uint32_t DITENA     : 1;
	__IO uint32_t DITENB     : 1;
	__IO uint32_t DITENS     : 1;
	__IO uint32_t RERSEVED2  : 21;
}tim6_ctrlr_field_t;
typedef struct
{
	__IO uint32_t FBRAKE     : 1;			
	__IO uint32_t FSAME      : 1;	
	__IO uint32_t BFILTS     : 2;	
	__IO uint32_t BFILTEN    : 1;
	__IO uint32_t RERSEVED1  : 2;
	__IO uint32_t SOFTB      : 1;
	__IO uint32_t SML0       : 1;
	__IO uint32_t SML1       : 1;
	__IO uint32_t SML2       : 1;
	__IO uint32_t SMH0       : 1;
	__IO uint32_t SMH1       : 1;
	__IO uint32_t SMH2       : 1;
	__IO uint32_t RERSEVED2  : 18;
}tim6_aossr_field_t;
typedef struct
{
	__IO uint32_t FBRAKE  : 1;			
	__IO uint32_t FSAME  : 1;	
		
	__IO uint32_t RERSEVED2  : 30;
}tim6_aoscl_field_t;
typedef struct
{
	__IO uint32_t TRIGAS  : 4;
	__IO uint32_t TRIGBS  : 4;
	__IO uint32_t TRIGCS  : 4;
	__IO uint32_t TRIGDS  : 4;
	__IO uint32_t RERSEVED2  : 16;
}tim6_tmtrig_field_t;
typedef struct
{
	__IO uint32_t IAOS0S  : 4;
	__IO uint32_t IAOS1S  : 4;
	__IO uint32_t IAOS2S  : 4;
	__IO uint32_t IAOS3S  : 4;
	__IO uint32_t RERSEVED2  : 16;
}tim6_itrig_field_t;
typedef struct
{
	__IO uint32_t EN0  : 1;
	__IO uint32_t EN1  : 1;
	__IO uint32_t EN2  : 1;
	__IO uint32_t EN3  : 1;
	__IO uint32_t EN4  : 1;
	__IO uint32_t EN5  : 1;
	__IO uint32_t EN6  : 1;
	__IO uint32_t EN7  : 1;
	__IO uint32_t EN8  : 1;
	__IO uint32_t EN9  : 1;
	__IO uint32_t EN10  : 1;
	__IO uint32_t EN11  : 1;
	__IO uint32_t EN12  : 1;
	__IO uint32_t EN13  : 1;
	__IO uint32_t EN14  : 1;
	__IO uint32_t EN15  : 1;
	__IO uint32_t RERSEVED  : 16;
}tim6_ptbks_field_t;
typedef struct
{
	__IO uint32_t POL0  : 1;
	__IO uint32_t POL1  : 1;
	__IO uint32_t POL2  : 1;
	__IO uint32_t POL3  : 1;
	__IO uint32_t POL4  : 1;
	__IO uint32_t POL5  : 1;
	__IO uint32_t POL6  : 1;
	__IO uint32_t POL7  : 1;
	__IO uint32_t POL8  : 1;
	__IO uint32_t POL9  : 1;
	__IO uint32_t POL10  : 1;
	__IO uint32_t POL11  : 1;
	__IO uint32_t POL12  : 1;
	__IO uint32_t POL13  : 1;
	__IO uint32_t POL14  : 1;
	__IO uint32_t POL15  : 1;
	__IO uint32_t RERSEVED2  : 16;
}tim6_ptbkpol_field_t;
typedef struct 
{
	__IO uint32_t SSTA0    : 1;
	__IO uint32_t SSTA1    : 1;
	__IO uint32_t SSTA2    : 1;
	__IO uint32_t RERSEVED : 29;
	
}tim6_sstar_field_t;
typedef struct
{
	__IO uint32_t SSTP0    : 1;
	__IO uint32_t SSTP1    : 1;
	__IO uint32_t SSTP2    : 1;
	__IO uint32_t RERSEVED : 29;
}tim6_sstpr_field_t;
typedef struct
{
	__IO uint32_t SCLR0    : 1;
	__IO uint32_t SCLR1    : 1;
	__IO uint32_t SCLR2    : 1;
	__IO uint32_t RERSEVED : 29;
}tim6_sclrr_field_t;
typedef struct
{
	__IO uint32_t CNTER;          
	__IO uint32_t PERAR;          
	__IO uint32_t PERBR;         
	__IO uint32_t RERSEVED0;     

	__IO uint32_t GCMAR;          
	__IO uint32_t GCMBR;          
	__IO uint32_t GCMCR;          
	__IO uint32_t GCMDR;         

	__IO uint32_t RERSEVED1[8];

	__IO uint32_t DTUAR;          
	__IO uint32_t DTDAR;         
	__IO uint32_t RERSEVED2[2];  
								   
    union{
		__IO uint32_t GCONR;
		tim6_gconr_field_t GCONR_f;
	};
	union{
		__IO uint32_t ICONR;
		tim6_iconr_field_t ICONR_f;
	};
	union{
		__IO uint32_t PCONR;
		tim6_pconr_field_t PCONR_f;
	};
	union{
		__IO uint32_t BCONR;
		tim6_bconr_field_t BCONR_f;
	};

	union{
		__IO uint32_t DCONR;
		tim6_dconr_field_t DCONR_f;
	};

	__IO uint32_t RERSEVED3;     
	union{
		__IO uint32_t FCONR;
		tim6_fconr_field_t FCONR_f;
	};

	union{
		__IO uint32_t VPERR;
		tim6_vperr_field_t VPERR_f;
	};

	union{
		__IO uint32_t STFLR;
		tim6_stflr_field_t STFLR_f;
	};

	union{
		__IO uint32_t HSTAR;
		tim6_hstar_field_t HSTAR_f;
	};

	union{
		__IO uint32_t HSTPR;
		tim6_hstpr_field_t HSTPR_f;
	};

	union{
		__IO uint32_t HCLRR;
		tim6_hclrr_field_t HCLRR_f;
	};

	union{
		__IO uint32_t HCPAR;
		tim6_hcpar_field_t HCPAR_f;
	};

 	union{
		__IO uint32_t HCPBR;
		tim6_hcpbr_field_t HCPBR_f;
	};

	union{
		__IO uint32_t HCUPR;
		tim6_hcupr_field_t HCUPR_f;
	};

	union{
		__IO uint32_t HCDOR;
		tim6_hcdor_field_t HCDOR_f;
	};

	__IO uint32_t RERSEVED4[28];

	union{
		__IO uint32_t IFR;
		tim6_intfr_field_t IFR_f;
	};

	union{
		__IO uint32_t ICLR;
		tim6_intcr_field_t ICLR_f;
	};	
	
	union{
		__IO uint32_t CR;
		tim6_ctrlr_field_t CR_f;
	};

	__IO uint32_t RERSEVED5;     

	union{
		__IO uint32_t AOSSR;
		tim6_aossr_field_t AOSSR_f;
	};	

	union{
		__IO uint32_t AOSCL;
		tim6_aoscl_field_t AOSCL_f;
	};

	union{
		__IO uint32_t PTBKS;
		tim6_ptbks_field_t PTBKS_f;
	};

	union{
		__IO uint32_t TTRIG;
		tim6_tmtrig_field_t TTRIG_f;
	};	

	union{
		__IO uint32_t ITRIG;
		tim6_itrig_field_t ITRIG_f;
	};	

	union{
		__IO uint32_t PTBKP;
		tim6_ptbkpol_field_t PTBKP_f;
	};	
	
	__IO uint32_t RERSEVED6[179];							

	union{
		__IO uint32_t SSTAR;          
		tim6_sstar_field_t SSTAR_f;
	};
	union{
		__IO uint32_t SSTPR;        
		tim6_sstpr_field_t SSTPR_f;
	};
	union{
		__IO uint32_t SCLRR;         
		tim6_sclrr_field_t SCLRR_f;
	};

}ADV_TIM_REG_TypeDef;

#define L005_TIM4           ((ADV_TIM_REG_TypeDef *)TIM4_BASEADDR)	
#define L005_TIM5           ((ADV_TIM_REG_TypeDef *)TIM5_BASEADDR)		
#define L005_TIM6           ((ADV_TIM_REG_TypeDef *)TIM6_BASEADDR)	

/*  **********   FLASH_CTRL struct    **********  */
typedef struct
{
	__IO uint32_t TNVS                   : 9;
	__IO uint32_t RERSEVED               : 23;
}flash_tnvs_field_t;

typedef struct
{
	__IO uint32_t TPGS                   : 8;
	__IO uint32_t RERSEVED               : 24;
}flash_tpgs_field_t;

typedef struct
{
	__IO uint32_t TPROG                  : 8;
	__IO uint32_t RERSEVED               : 24;
}flash_tprog_field_t;

typedef struct
{
	__IO uint32_t TSERASE                : 18;
	__IO uint32_t RERSEVED               : 14;
}flash_tserase_field_t;

typedef struct
{
	__IO uint32_t TMERASE                : 21;
	__IO uint32_t RERSEVED               : 11;
}flash_tmerase_field_t;

typedef struct
{
	__IO uint32_t TPRCV                  : 12;
	__IO uint32_t RERSEVED               : 20;
}flash_tprcv_field_t;

typedef struct
{
	__IO uint32_t TSRCV                  : 12;
	__IO uint32_t RERSEVED               : 20;
}flash_tsrcv_field_t;

typedef struct
{
	__IO uint32_t TMRCV                  : 13;
	__IO uint32_t RERSEVED               : 19;
}flash_tmrcv_field_t;
typedef struct
{
	__IO uint32_t OP    				 : 2;
	__IO uint32_t WAIT				     : 1;
	__IO uint32_t RERSEVED               : 1;
	__IO uint32_t BUSY                   : 1;
	__IO uint32_t IE                     : 2;
	__IO uint32_t RERSEVED1              : 25;
}flash_ctrl_field_t;

typedef struct
{
	__IO uint32_t IF0                    : 1;
	__IO uint32_t IF1       			 : 1;
    __IO uint32_t RERSEVED1              : 32;
}flash_ifr_field_t;

typedef struct
{
	__IO uint32_t ICLR0		             : 1;
	__IO uint32_t ICLR1				     : 1;
	__IO uint32_t RERSEVED               : 32;
}flash_iclr_field_t;

typedef struct 
{
	__IO uint32_t BYSEQ                  : 16;
	__IO uint32_t RERSEVED               : 16;
}flash_bypass_field_t;

typedef struct 
{
	__IO uint32_t SLOCK                  : 16;
	__IO uint32_t RERSEVED               : 16;
}flash_slock_field_t;

typedef struct
{
	union{
		__IO uint32_t TNVS;
		flash_tnvs_field_t TNVS_f;
	};
	union{
		__IO uint32_t TPGS;
		flash_tpgs_field_t TPGS_f;
	};
	union{
		__IO uint32_t TPROG;
		flash_tprog_field_t TPROG_f;
	};
	union{
		__IO uint32_t TSERASE;
		flash_tserase_field_t TSERASE_f;
	};
	union{
		__IO uint32_t TMERASE;
		flash_tmerase_field_t TMERASE_f;
	};
	union{
		__IO uint32_t TPRCV;
		flash_tprcv_field_t TPRCV_f;
	};
	union{
		__IO uint32_t TSRCV;
		flash_tsrcv_field_t TSRCV_f;
	};
	union{
		__IO uint32_t TMRCV;
		flash_tmrcv_field_t TMRCV_f;
	};
	union{
		__IO uint32_t CR;
		flash_ctrl_field_t CR_f;
	};
	union{
		__IO uint32_t IFR;
		flash_ifr_field_t IFR_f;
	};
	union{
		__IO uint32_t ICLR;
		flash_iclr_field_t ICLR_f;
	};
	union{
		__IO uint32_t BYPASS;
		flash_bypass_field_t BYPASS_f;
	};
	union{
		__IO uint32_t SLOCK;
		flash_slock_field_t SLOCK_f;
	};
}EFLASH_REG_TypeDef;

#define L005_FLASH           ((EFLASH_REG_TypeDef *)EFLASH_CTRL_BASEADDR)

/*  **********   RAM_CTRL struct    **********  */

typedef struct
{
	__IO uint32_t CHKEN         	: 1;
	__IO uint32_t IE        		: 1;
	__IO uint32_t RERSEVED          : 30;
}ram_ctrl_field_t;

typedef struct
{
	__IO uint32_t ERRADDR           : 12;
	__IO uint32_t RERSEVED          : 20;
}ram_erraddr_field_t;

typedef struct
{
	__IO uint32_t ERR               : 1;
	__IO uint32_t RERSEVED          : 31;
}ram_ifr_field_t;

typedef struct
{
	__IO uint32_t ERRCLR            : 1;
	__IO uint32_t RERSEVED          : 31;
}ram_iclr_field_t;
typedef struct
{
	union {
		__IO uint32_t CR;
		ram_ctrl_field_t CR_f;
	};
	union {
		__IO uint32_t ERRADDR;
		ram_erraddr_field_t ERRADDR_f;
	};
	union {
		__IO uint32_t IFR;
		ram_ifr_field_t IFR_f;
	};
	union {
		__IO uint32_t ICLR;
		ram_iclr_field_t ICLR_f;
	};
	
