havenxie/HC32Lxx-FirmWare/HC32L110Code_Lib/lib/inc/hc32lxx.h
}RAM_REG_TypeDef;

#define L005_RAM             ((RAM_REG_TypeDef *)RAM_CTRL_BASEADDR)

/*  **********   DES struct    **********  */


/*  **********   CRC struct    **********  */

typedef struct
{
	__IO uint32_t RESULT    	    : 16;
	__IO uint32_t FLAG				: 1;
	__IO uint32_t RERSEVED          : 15;
}crc_resultreg_field_t;

typedef struct
{
	__IO uint32_t RERSEVED0;
	
	union {
		__IO uint32_t RESULT;
		crc_resultreg_field_t RESULT_f;
	};
	
	__IO uint32_t RERSEVED1[30];
	
	union {
		__IO uint32_t DATA_WORD;
		__IO uint16_t DATA_HALFWORD;
		__IO uint8_t  DATA_BYTE;
	};
}CRC_REG_TypeDef;

#define L005_CRC							((CRC_REG_TypeDef *)CRC_BASEADDR)

/*  **********   PORT_CTRL struct    **********  */

typedef struct
{
	__IO uint32_t RERSEVED  : 1;
	__IO uint32_t P0DIR1	: 1;
	__IO uint32_t P0DIR2	: 1;
	__IO uint32_t P0DIR3	: 1;
}p0dir_field_t;

typedef struct
{
	__IO uint32_t P0IN0	    : 1;
	__IO uint32_t P0IN1	    : 1;
	__IO uint32_t P0IN2	    : 1;
	__IO uint32_t P0IN3	    : 1;
}p0in_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P0OUT1	: 1;
	__IO uint32_t P0OUT2	: 1;
	__IO uint32_t P0OUT3	: 1;
}p0out_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P0ADS1	: 1;
	__IO uint32_t P0ADS2	: 1;
	__IO uint32_t P0ADS3	: 1;
}p0ads_field_t;

typedef struct
{
	__IO uint32_t P0CS0	    : 1;
	__IO uint32_t P0CS1	    : 1;
	__IO uint32_t P0CS2	    : 1;
	__IO uint32_t P0CS3	    : 1;
}p0cs_field_t;

typedef struct
{
	__IO uint32_t P0IE0	    : 1;
	__IO uint32_t P0IE1	    : 1;
	__IO uint32_t P0IE2	    : 1;
	__IO uint32_t P0IE3	    : 1;
}p0ie_field_t;

typedef struct
{
	__IO uint32_t P0SR0	    : 1;
	__IO uint32_t P0SR1	    : 1;
	__IO uint32_t P0SR2	    : 1;
	__IO uint32_t P0SR3	    : 1;
}p0sr_field_t;

typedef struct
{
	__IO uint32_t RERSEVED  : 1;
	__IO uint32_t P0DR1	    : 1;
	__IO uint32_t P0DR2	    : 1;
	__IO uint32_t P0DR3	    : 1;
}p0dr_field_t;

typedef struct
{
	__IO uint32_t RERSEVED  : 1; 
	__IO uint32_t P0PU1	    : 1;
	__IO uint32_t P0PU2	    : 1;
	__IO uint32_t P0PU3	    : 1;
}p0pu_field_t;

typedef struct
{
	__IO uint32_t RERSEVED  : 1;
	__IO uint32_t P0PD1	    : 1;
	__IO uint32_t P0PD2	    : 1;
	__IO uint32_t P0PD3	    : 1;
}p0pd_field_t;

typedef struct
{
	__IO uint32_t P0OS0	    : 1;
	__IO uint32_t P0OS1	    : 1;
	__IO uint32_t P0OS2	    : 1;
	__IO uint32_t P0OS3	    : 1;
}p0os_field_t;

typedef struct
{
	__IO uint32_t RERSEVED  : 1;
	__IO uint32_t P0OD1	    : 1;
	__IO uint32_t P0OD2	    : 1;
	__IO uint32_t P0OD3	    : 1;
}p0od_field_t;

typedef struct
{
	__IO uint32_t P0HIE0    : 1;
	__IO uint32_t P0HIE1    : 1;
	__IO uint32_t P0HIE2    : 1;
	__IO uint32_t P0HIE3    : 1;
}p0inten0_field_t;

typedef struct
{
	__IO uint32_t P0LIE0    : 1;
	__IO uint32_t P0LIE1    : 1;
	__IO uint32_t P0LIE2    : 1;
	__IO uint32_t P0LIE3    : 1;
}p0inten1_field_t;

typedef struct
{
	__IO uint32_t P0RIE0	: 1;
	__IO uint32_t P0RIE1	: 1;
	__IO uint32_t P0RIE2	: 1;
	__IO uint32_t P0RIE3	: 1;
}p0inten2_field_t;

typedef struct
{
	__IO uint32_t P0FIE0 	: 1;
	__IO uint32_t P0FIE1 	: 1;
	__IO uint32_t P0FIE2 	: 1;
	__IO uint32_t P0FIE3 	: 1;
}p0inten3_field_t;

typedef struct
{
	__IO uint32_t P0STA0	: 1;
	__IO uint32_t P0STA1	: 1;
	__IO uint32_t P0STA2	: 1;
	__IO uint32_t P0STA3	: 1;
}p0stat_field_t;

typedef struct
{
	__IO uint32_t P0CLR0	: 1;
	__IO uint32_t P0CLR1	: 1;
	__IO uint32_t P0CLR2	: 1;
	__IO uint32_t P0CLR3	: 1;
}p0iclr_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1DIR4	: 1;
	__IO uint32_t P1DIR5	: 1;
}p1dir_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1IN4	: 1;
	__IO uint32_t P1IN5	: 1;
}p1in_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1OUT4	: 1;
	__IO uint32_t P1OUT5	: 1;
}p1out_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1ADS4	: 1;
	__IO uint32_t P1ADS5	: 1;
}p1ads_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1CS4	: 1;
	__IO uint32_t P1CS5	: 1;
}p1cs_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1IE4	: 1;
	__IO uint32_t P1IE5	: 1;
}p1ie_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1SR4	: 1;
	__IO uint32_t P1SR5	: 1;
}p1sr_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1DR4	: 1;
	__IO uint32_t P1DR5	: 1;
}p1dr_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1PU4	: 1;
	__IO uint32_t P1PU5	: 1;
}p1pu_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1PD4	: 1;
	__IO uint32_t P1PD5	: 1;
}p1pd_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1OS4	: 1;
	__IO uint32_t P1OS5	: 1;
}p1os_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1OD4	: 1;
	__IO uint32_t P1OD5	: 1;
}p1od_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1HIE4	: 1;
	__IO uint32_t P1HIE5	: 1;
}p1inten0_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1LIE4	: 1;
	__IO uint32_t P1LIE5	: 1;
}p1inten1_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1RIE4	: 1;
	__IO uint32_t P1RIE5	: 1;
}p1inten2_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1FIE4	: 1;
	__IO uint32_t P1FIE5	: 1;
}p1inten3_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1STA4	: 1;
	__IO uint32_t P1STA5	: 1;
}p1stat_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 4;
	__IO uint32_t P1CLR4	: 1;
	__IO uint32_t P1CLR5	: 1;
}p1iclr_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2DIR3	: 1;
	__IO uint32_t P2DIR4	: 1;
	__IO uint32_t P2DIR5	: 1;
	__IO uint32_t P2DIR6	: 1;
	__IO uint32_t P2DIR7	: 1;
}p2dir_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2IN3	: 1;
	__IO uint32_t P2IN4	: 1;
	__IO uint32_t P2IN5	: 1;
	__IO uint32_t P2IN6	: 1;
	__IO uint32_t P2IN7	: 1;
}p2in_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2OUT3	: 1;
	__IO uint32_t P2OUT4	: 1;
	__IO uint32_t P2OUT5	: 1;
	__IO uint32_t P2OUT6	: 1;
	__IO uint32_t P2OUT7	: 1;
}p2out_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2ADS3	: 1;
	__IO uint32_t P2ADS4	: 1;
	__IO uint32_t P2ADS5	: 1;
	__IO uint32_t P2ADS6	: 1;
	__IO uint32_t P2ADS7	: 1;
}p2ads_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2CS3	: 1;
	__IO uint32_t P2CS4	: 1;
	__IO uint32_t P2CS5	: 1;
	__IO uint32_t P2CS6	: 1;
	__IO uint32_t P2CS7	: 1;
}p2cs_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2IE3	: 1;
	__IO uint32_t P2IE4	: 1;
	__IO uint32_t P2IE5	: 1;
	__IO uint32_t P2IE6	: 1;
	__IO uint32_t P2IE7	: 1;
}p2ie_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2SR3	: 1;
	__IO uint32_t P2SR4	: 1;
	__IO uint32_t P2SR5	: 1;
	__IO uint32_t P2SR6	: 1;
	__IO uint32_t P2SR7	: 1;
}p2sr_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2DR3	: 1;
	__IO uint32_t P2DR4	: 1;
	__IO uint32_t P2DR5	: 1;
	__IO uint32_t P2DR6	: 1;
	__IO uint32_t P2DR7	: 1;
}p2dr_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2PU3	: 1;
	__IO uint32_t P2PU4	: 1;
	__IO uint32_t P2PU5	: 1;
	__IO uint32_t P2PU6	: 1;
	__IO uint32_t P2PU7	: 1;
}p2pu_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2PD3	: 1;
	__IO uint32_t P2PD4	: 1;
	__IO uint32_t P2PD5	: 1;
	__IO uint32_t P2PD6	: 1;
	__IO uint32_t P2PD7	: 1;
}p2pd_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2OS3	: 1;
	__IO uint32_t P2OS4	: 1;
	__IO uint32_t P2OS5	: 1;
	__IO uint32_t P2OS6	: 1;
	__IO uint32_t P2OS7	: 1;
}p2os_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2OD3	: 1;
	__IO uint32_t P2OD4	: 1;
	__IO uint32_t P2OD5	: 1;
	__IO uint32_t P2OD6	: 1;
	__IO uint32_t P2OD7	: 1;
}p2od_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2HIE3	: 1;
	__IO uint32_t P2HIE4	: 1;
	__IO uint32_t P2HIE5	: 1;
	__IO uint32_t P2HIE6	: 1;
	__IO uint32_t P2HIE7	: 1;
}p2inten0_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2LIE3	: 1;
	__IO uint32_t P2LIE4	: 1;
	__IO uint32_t P2LIE5	: 1;
	__IO uint32_t P2LIE6	: 1;
	__IO uint32_t P2LIE7	: 1;
}p2inten1_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2RIE3	: 1;
	__IO uint32_t P2RIE4	: 1;
	__IO uint32_t P2RIE5	: 1;
	__IO uint32_t P2RIE6	: 1;
	__IO uint32_t P2RIE7	: 1;
}p2inten2_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2FIE3	: 1;
	__IO uint32_t P2FIE4	: 1;
	__IO uint32_t P2FIE5	: 1;
	__IO uint32_t P2FIE6	: 1;
	__IO uint32_t P2FIE7	: 1;
}p2inten3_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2STA3	: 1;
	__IO uint32_t P2STA4	: 1;
	__IO uint32_t P2STA5	: 1;
	__IO uint32_t P2STA6	: 1;
	__IO uint32_t P2STA7	: 1;
}p2stat_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 3;
	__IO uint32_t P2CLR3	: 1;
	__IO uint32_t P2CLR4	: 1;
	__IO uint32_t P2CLR5	: 1;
	__IO uint32_t P2CLR6	: 1;
	__IO uint32_t P2CLR7	: 1;
}p2iclr_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3DIR1	: 1;
	__IO uint32_t P3DIR2	: 1;
	__IO uint32_t P3DIR3	: 1;
	__IO uint32_t P3DIR4	: 1;
	__IO uint32_t P3DIR5	: 1;
	__IO uint32_t P3DIR6	: 1;
}p3dir_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3IN1	: 1;
	__IO uint32_t P3IN2	: 1;
	__IO uint32_t P3IN3	: 1;
	__IO uint32_t P3IN4	: 1;
	__IO uint32_t P3IN5	: 1;
	__IO uint32_t P3IN6	: 1;
}p3in_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3OUT1	: 1;
	__IO uint32_t P3OUT2	: 1;
	__IO uint32_t P3OUT3	: 1;
	__IO uint32_t P3OUT4	: 1;
	__IO uint32_t P3OUT5	: 1;
	__IO uint32_t P3OUT6	: 1;
}p3out_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3ADS1	: 1;
	__IO uint32_t P3ADS2	: 1;
	__IO uint32_t P3ADS3	: 1;
	__IO uint32_t P3ADS4	: 1;
	__IO uint32_t P3ADS5	: 1;
	__IO uint32_t P3ADS6	: 1;
}p3ads_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3CS1	: 1;
	__IO uint32_t P3CS2	: 1;
	__IO uint32_t P3CS3	: 1;
	__IO uint32_t P3CS4	: 1;
	__IO uint32_t P3CS5	: 1;
	__IO uint32_t P3CS6	: 1;
}p3cs_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3IE1	: 1;
	__IO uint32_t P3IE2	: 1;
	__IO uint32_t P3IE3	: 1;
	__IO uint32_t P3IE4	: 1;
	__IO uint32_t P3IE5	: 1;
	__IO uint32_t P3IE6	: 1;
}p3ie_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3SR1	: 1;
	__IO uint32_t P3SR2	: 1;
	__IO uint32_t P3SR3	: 1;
	__IO uint32_t P3SR4	: 1;
	__IO uint32_t P3SR5	: 1;
	__IO uint32_t P3SR6	: 1;
}p3sr_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3DR1	: 1;
	__IO uint32_t P3DR2	: 1;
	__IO uint32_t P3DR3	: 1;
	__IO uint32_t P3DR4	: 1;
	__IO uint32_t P3DR5	: 1;
	__IO uint32_t P3DR6	: 1;
}p3dr_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3PU1	: 1;
	__IO uint32_t P3PU2	: 1;
	__IO uint32_t P3PU3	: 1;
	__IO uint32_t P3PU4	: 1;
	__IO uint32_t P3PU5	: 1;
	__IO uint32_t P3PU6	: 1;
}p3pu_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3PD1	: 1;
	__IO uint32_t P3PD2	: 1;
	__IO uint32_t P3PD3	: 1;
	__IO uint32_t P3PD4	: 1;
	__IO uint32_t P3PD5	: 1;
	__IO uint32_t P3PD6	: 1;
}p3pd_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3OS1	: 1;
	__IO uint32_t P3OS2	: 1;
	__IO uint32_t P3OS3	: 1;
	__IO uint32_t P3OS4	: 1;
	__IO uint32_t P3OS5	: 1;
	__IO uint32_t P3OS6	: 1;
}p3os_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3OD1	: 1;
	__IO uint32_t P3OD2	: 1;
	__IO uint32_t P3OD3	: 1;
	__IO uint32_t P3OD4	: 1;
	__IO uint32_t P3OD5	: 1;
	__IO uint32_t P3OD6	: 1;
}p3od_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3HIE1	: 1;
	__IO uint32_t P3HIE2	: 1;
	__IO uint32_t P3HIE3	: 1;
	__IO uint32_t P3HIE4	: 1;
	__IO uint32_t P3HIE5	: 1;
	__IO uint32_t P3HIE6	: 1;
}p3inten0_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3LIE1	: 1;
	__IO uint32_t P3LIE2	: 1;
	__IO uint32_t P3LIE3	: 1;
	__IO uint32_t P3LIE4	: 1;
	__IO uint32_t P3LIE5	: 1;
	__IO uint32_t P3LIE6	: 1;
}p3inten1_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3RIE1	: 1;
	__IO uint32_t P3RIE2	: 1;
	__IO uint32_t P3RIE3	: 1;
	__IO uint32_t P3RIE4	: 1;
	__IO uint32_t P3RIE5	: 1;
	__IO uint32_t P3RIE6	: 1;
}p3inten2_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3FIE1	: 1;
	__IO uint32_t P3FIE2	: 1;
	__IO uint32_t P3FIE3	: 1;
	__IO uint32_t P3FIE4	: 1;
	__IO uint32_t P3FIE5	: 1;
	__IO uint32_t P3FIE6	: 1;
}p3inten3_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3STA1	: 1;
	__IO uint32_t P3STA2	: 1;
	__IO uint32_t P3STA3	: 1;
	__IO uint32_t P3STA4	: 1;
	__IO uint32_t P3STA5	: 1;
	__IO uint32_t P3STA6	: 1;
}p3stat_field_t;

typedef struct
{
	__IO uint32_t RERSEVED	: 1;
	__IO uint32_t P3CLR1	: 1;
	__IO uint32_t P3CLR2	: 1;
	__IO uint32_t P3CLR3	: 1;
	__IO uint32_t P3CLR4	: 1;
	__IO uint32_t P3CLR5	: 1;
	__IO uint32_t P3CLR6	: 1;
}p3iclr_field_t;

typedef struct
{
	__IO uint32_t ext_clk_sel	: 4;
	__IO uint32_t ssn_sel		: 4;
	__IO uint32_t pclk_sel		: 2;
	__IO uint32_t hclk_sel		: 2;
	__IO uint32_t pclk_en		: 1;
	__IO uint32_t hclk_en		: 1;
	__IO uint32_t ir_pol		: 1;
}gpio_ctrl1_field_t;

typedef struct
{
	__IO uint32_t pca_cap0_sel	: 2;
	__IO uint32_t pca_cap1_sel	: 2;
	__IO uint32_t pca_cap2_sel	: 2;
	__IO uint32_t pca_cap3_sel	: 2;
	__IO uint32_t pca_cap4_sel	: 2;
}gpio_ctrl2_field_t;

typedef struct
{
	__IO uint32_t tm6_b0_sel	: 2;
	__IO uint32_t tm6_b1_sel	: 2;
	__IO uint32_t tm6_b2_sel	: 2;
	__IO uint32_t tm6_a0_sel	: 2;
	__IO uint32_t tm6_a1_sel	: 2;
	__IO uint32_t tm6_a2_sel	: 2;
}gpio_ctrl3_field_t;

typedef struct
{
	__IO uint32_t tm0_gate_sel	: 2;
	__IO uint32_t tm1_gate_sel	: 2;
	__IO uint32_t tm2_gate_sel	: 2;
	__IO uint32_t tm3_gate_sel	: 2;
}gpio_ctrl4_field_t;

typedef struct
{
	__IO uint32_t RERSEVED0;
	
	__IO uint32_t P01_SEL;
	__IO uint32_t P02_SEL;
	__IO uint32_t P03_SEL;
	
	__IO uint32_t RERSEVED1[0x10];
	
	__IO uint32_t P14_SEL;
	__IO uint32_t P15_SEL;
	
