havenxie/HC32Lxx-FirmWare/HC32L110Code_Lib/lib/inc/hc32lxx.h
	__IO uint32_t RERSEVED2[0xd];
	
	__IO uint32_t P23_SEL;
	__IO uint32_t P24_SEL;
	__IO uint32_t P25_SEL;
	__IO uint32_t P26_SEL;
	__IO uint32_t P27_SEL;
	
	__IO uint32_t RERSEVED3[0x9];
	
	__IO uint32_t P31_SEL;
	__IO uint32_t P32_SEL;
	__IO uint32_t P33_SEL;
	__IO uint32_t P34_SEL;
	__IO uint32_t P35_SEL;
	__IO uint32_t P36_SEL;
	
	__IO uint32_t RERSEVED4[0x9];
	
	union {
		__IO uint32_t P0DIR;
		p0dir_field_t P0DIR_f;
	};
	
	union {
		__IO uint32_t P0IN;
		p0in_field_t P0IN_f;
	};
	
	union {
		__IO uint32_t P0OUT;
		p0out_field_t P0OUT_f;
	};
	
	union {
		__IO uint32_t P0ADS;
		p0ads_field_t P0ADS_f;
	};
	
//	union {
//		__IO uint32_t P0CS;
//		p0cs_field_t P0CS_f;
//	};
	
	__IO uint32_t RERSEVED5[3];
	
//	union {
//		__IO uint32_t P0SR;
//		p0sr_field_t P0SR_f;
//	};
	
	union {
		__IO uint32_t P0DR;
		p0dr_field_t P0DR_f;
	};
	
	union {
		__IO uint32_t P0PU;
		p0pu_field_t P0PU_f;
	};
	
	union {
		__IO uint32_t P0PD;
		p0pd_field_t P0PD_f;
	};
	
	__IO uint32_t RERSEVED6;
//	union {
//		__IO uint32_t P0OS;
//		p0os_field_t P0OS_f;
//	};
	
	union {
		__IO uint32_t P0OD;
		p0od_field_t P0OD_f;
	};
	
	union {
		__IO uint32_t P0INTEN0;
		p0inten0_field_t P0INTEN0_f;
	};
	
	union {
		__IO uint32_t P0INTEN1;
		p0inten1_field_t P0INTEN1_f;
	};
	
	union {
		__IO uint32_t P0INTEN2;
		p0inten2_field_t P0INTEN2_f;
	};
	
	union {
		__IO uint32_t P0INTEN3;
		p0inten3_field_t P0INTEN3_f;
	};
	
	union {
		__IO uint32_t P1DIR;
		p1dir_field_t P1DIR_f;
	};
	
	union {
		__IO uint32_t P1IN;
		p1in_field_t P1IN_f;
	};
	
	union {
		__IO uint32_t P1OUT;
		p1out_field_t P1OUT_f;
	};
	
	union {
		__IO uint32_t P1ADS;
		p1ads_field_t P1ADS_f;
	};
	
//	union {
//		__IO uint32_t P1CS;
//		p1cs_field_t P1CS_f;
//	};
	
	__IO uint32_t RERSEVED7[3];
	
//	union {
//		__IO uint32_t P1SR;
//		p1sr_field_t P1SR_f;
//	};
	
	union {
		__IO uint32_t P1DR;
		p1dr_field_t P1DR_f;
	};
	
	union {
		__IO uint32_t P1PU;
		p1pu_field_t P1PU_f;
	};
	
	union {
		__IO uint32_t P1PD;
		p1pd_field_t P1PD_f;
	};
	
	__IO uint32_t RERSEVED8;
//	union {
//		__IO uint32_t P1OS;
//		p1os_field_t P1OS_f;
//	};
	
	union {
		__IO uint32_t P1OD;
		p1od_field_t P1OD_f;
	};
	
	union {
		__IO uint32_t P1INTEN0;
		p1inten0_field_t P1INTEN0_f;
	};
	
	union {
		__IO uint32_t P1INTEN1;
		p1inten1_field_t P1INTEN1_f;
	};
	
	union {
		__IO uint32_t P1INTEN2;
		p1inten2_field_t P1INTEN2_f;
	};
	
	union {
		__IO uint32_t P1INTEN3;
		p1inten3_field_t P1INTEN3_f;
	};
	
	union {
		__IO uint32_t P2DIR;
		p2dir_field_t P2DIR_f;
	};
	
	union {
		__IO uint32_t P2IN;
		p2in_field_t P2IN_f;
	};
	
	union {
		__IO uint32_t P2OUT;
		p2out_field_t P2OUT_f;
	};
	
	union {
		__IO uint32_t P2ADS;
		p2ads_field_t P2ADS_f;
	};
	
//	union {
//		__IO uint32_t P2CS;
//		p2cs_field_t P2CS_f;
//	};
	
	__IO uint32_t RERSEVED9[3];
	
//	union {
//		__IO uint32_t P2SR;
//		p2sr_field_t P2SR_f;
//	};
	
	union {
		__IO uint32_t P2DR;
		p2dr_field_t P2DR_f;
	};
	
	union {
		__IO uint32_t P2PU;
		p2pu_field_t P2PU_f;
	};
	
	union {
		__IO uint32_t P2PD;
		p2pd_field_t P2PD_f;
	};
	
	__IO uint32_t RERSEVED10;
//	union {
//		__IO uint32_t P2OS;
//		p2os_field_t P2OS_f;
//	};
	
	union {
		__IO uint32_t P2OD;
		p2od_field_t P2OD_f;
	};
	
	union {
		__IO uint32_t P2INTEN0;
		p2inten0_field_t P2INTEN0_f;
	};
	
	union {
		__IO uint32_t P2INTEN1;
		p2inten1_field_t P2INTEN1_f;
	};
	
	union {
		__IO uint32_t P2INTEN2;
		p2inten2_field_t P2INTEN2_f;
	};
	
	union {
		__IO uint32_t P2INTEN3;
		p2inten3_field_t P2INTEN3_f;
	};
	
	union {
		__IO uint32_t P3DIR;
		p3dir_field_t P3DIR_f;
	};
	
	union {
		__IO uint32_t P3IN;
		p3in_field_t P3IN_f;
	};
	
	union {
		__IO uint32_t P3OUT;
		p3out_field_t P3OUT_f;
	};
	
	union {
		__IO uint32_t P3ADS;
		p3ads_field_t P3ADS_f;
	};
	
//	union {
//		__IO uint32_t P3CS;
//		p3cs_field_t P3CS_f;
//	};
	
	__IO uint32_t RERSEVED11[3];
	
//	union {
//		__IO uint32_t P3SR;
//		p3sr_field_t P3SR_f;
//	};
	
	union {
		__IO uint32_t P3DR;
		p3dr_field_t P3DR_f;
	};
	
	union {
		__IO uint32_t P3PU;
		p3pu_field_t P3PU_f;
	};
	
	union {
		__IO uint32_t P3PD;
		p3pd_field_t P3PD_f;
	};
	
	__IO uint32_t RERSEVED12;
//	union {
//		__IO uint32_t P3OS;
//		p3os_field_t P3OS_f;
//	};
	
	union {
		__IO uint32_t P3OD;
		p3od_field_t P3OD_f;
	};
	
	union {
		__IO uint32_t P3INTEN0;
		p3inten0_field_t P3INTEN0_f;
	};
	
	union {
		__IO uint32_t P3INTEN1;
		p3inten1_field_t P3INTEN1_f;
	};
	
	union {
		__IO uint32_t P3INTEN2;
		p3inten2_field_t P3INTEN2_f;
	};
	
	union {
		__IO uint32_t P3INTEN3;
		p3inten3_field_t P3INTEN3_f;
	};
	
	union {
		__IO uint32_t P0_STAT;
		p0stat_field_t P0_STAT_f;
	};
	
	__IO uint32_t RERSEVED13[3];
	
	union {
		__IO uint32_t P0_ICLR;
		p0iclr_field_t P0_ICLR_f;
	};
	
	__IO uint32_t RERSEVED14[0xb];
	
	union {
		__IO uint32_t P1_STAT;
		p1stat_field_t P1_STAT_f;
	};
	
	__IO uint32_t RERSEVED15[3];
	
	union {
		__IO uint32_t P1_ICLR;
		p1iclr_field_t P1_ICLR_f;
	};
	
	__IO uint32_t RERSEVED16[0xb];
	
	union {
		__IO uint32_t P2_STAT;
		p2stat_field_t P2_STAT_f;
	};
	
	__IO uint32_t RERSEVED17[3];
	
	union {
		__IO uint32_t P2_ICLR;
		p2iclr_field_t P2_ICLR_f;
	};
	
	__IO uint32_t RERSEVED18[0xb];
	
	union {
		__IO uint32_t P3_STAT;
		p3stat_field_t P3_STAT_f;
	};
	
	__IO uint32_t RERSEVED19[3];
	
	union {
		__IO uint32_t P3_ICLR;
		p3iclr_field_t P3_ICLR_f;
	};
	
	__IO uint32_t RERSEVED20[0xb];
	
	__IO uint32_t GPIO_CTRL0;
	
	union {
		__IO uint32_t GPIO_CTRL1;
		gpio_ctrl1_field_t GPIO_CTRL1_f;
	};
	
	union {
		__IO uint32_t GPIO_CTRL2;
		gpio_ctrl2_field_t GPIO_CTRL2_f;
	};
	
	union {
		__IO uint32_t GPIO_CTRL3;
		gpio_ctrl3_field_t GPIO_CTRL3_f;
	};
	
	union {
		__IO uint32_t GPIO_CTRL4;
		gpio_ctrl4_field_t GPIO_CTRL4_f;
	};
}PORT_CTRL_REG_TypeDef;

//#define PORT_CTRL_BASEADDR	 (0x40020C00)
#define L005_GPIO				((PORT_CTRL_REG_TypeDef *)PORT_CTRL_BASEADDR)

typedef struct
{
    __IO uint32_t SEL[8];
//  __IO uint32_t RERSEVED0;
//	__IO uint32_t Px1_SEL;
//	__IO uint32_t Px2_SEL;
//	__IO uint32_t Px3_SEL;
//    __IO uint32_t Px4_SEL;
//    __IO uint32_t Px5_SEL;
//    __IO uint32_t Px6_SEL;
//    __IO uint32_t Px7_SEL;
	
	__IO uint32_t RERSEVED1[56];
    union {
		__IO uint32_t PxDIR;
		p0dir_field_t PxDIR_f;
	};
	
	union {
		__IO uint32_t PxIN;
		p0in_field_t PxIN_f;
	};
	
	union {
		__IO uint32_t PxOUT;
		p0out_field_t PxOUT_f;
	};
	
	union {
		__IO uint32_t PxADS;
		p0ads_field_t PxADS_f;
	};
	
//	union {
//		__IO uint32_t P0CS;
//		p0cs_field_t P0CS_f;
//	};
	
	__IO uint32_t RERSEVED5[3];
	
//	union {
//		__IO uint32_t P0SR;
//		p0sr_field_t P0SR_f;
//	};
	
	union {
		__IO uint32_t PxDR;
		p0dr_field_t PxDR_f;
	};
	
	union {
		__IO uint32_t PxPU;
		p0pu_field_t PxPU_f;
	};
	
	union {
		__IO uint32_t PxPD;
		p0pd_field_t PxPD_f;
	};
	
	__IO uint32_t RERSEVED6;
//	union {
//		__IO uint32_t P0OS;
//		p0os_field_t P0OS_f;
//	};
	
	union {
		__IO uint32_t PxOD;
		p0od_field_t PxOD_f;
	};
	
	union {
		__IO uint32_t PxINTEN0;
		p0inten0_field_t PxINTEN0_f;
	};
	
	union {
		__IO uint32_t PxINTEN1;
		p0inten1_field_t PxINTEN1_f;
	};
	
	union {
		__IO uint32_t PxINTEN2;
		p0inten2_field_t PxINTEN2_f;
	};
	
	union {
		__IO uint32_t PxINTEN3;
		p0inten3_field_t PxINTEN3_f;
	};
}GPIO_TypeDef;
#define GPIO0               ((GPIO_TypeDef *)(PORT_CTRL_BASEADDR))
#define GPIO1               ((GPIO_TypeDef *)(PORT_CTRL_BASEADDR + 0x40))
#define GPIO2               ((GPIO_TypeDef *)(PORT_CTRL_BASEADDR + 0x80))
#define GPIO3               ((GPIO_TypeDef *)(PORT_CTRL_BASEADDR + 0xC0))

#define RCC_AHBENR_UART0                 ((uint32_t)0x00000001)
#define RCC_AHBENR_UART1                 ((uint32_t)0x00000002)
#define RCC_AHBENR_LPUART                ((uint32_t)0x00000004)
#define RCC_AHBENR_I2C                   ((uint32_t)0x00000010)
#define RCC_AHBENR_SPI                   ((uint32_t)0x00000040)
#define RCC_AHBENR_BASETIME              ((uint32_t)0x00000100)
#define RCC_AHBENR_LPTIME                ((uint32_t)0x00000200)
#define RCC_AHBENR_ADVTIME               ((uint32_t)0x00000400)
#define RCC_AHBENR_PCA                   ((uint32_t)0x00004000)
#define RCC_AHBENR_WDT                   ((uint32_t)0x00008000)
#define RCC_AHBENR_ADC                   ((uint32_t)0x00010000)
#define RCC_AHBENR_VC                    ((uint32_t)0x00020000)
#define RCC_AHBENR_RTC                   ((uint32_t)0x00100000)
#define RCC_AHBENR_CLKTRIM               ((uint32_t)0x00200000)
#define RCC_AHBENR_BOOT                  ((uint32_t)0x00800000)
#define RCC_AHBENR_SYSTICK               ((uint32_t)0x01000000)
#define RCC_AHBENR_SWD                   ((uint32_t)0x02000000)
#define RCC_AHBENR_CRC                   ((uint32_t)0x04000000)
#define RCC_AHBENR_GPIO                  ((uint32_t)0x10000000)        /*!< GPIO clock enable */
#define RCC_AHBENR_FLASH                 ((uint32_t)0x80000000)


#define UART_SCON_RIEN                   ((uint32_t)0x00000001)
#define UART_SCON_TIEN                   ((uint32_t)0x00000002)
#define UART_SCON_RB8                    ((uint32_t)0x00000004)
#define UART_SCON_TB8                    ((uint32_t)0x00000008)
#define UART_SCON_REN                    ((uint32_t)0x00000010)
#define UART_SCON_SM2                    ((uint32_t)0x00000020)
#define UART_SCON_SM01_1                 ((uint32_t)0x00000040)
#define UART_SCON_SM01_2                 ((uint32_t)0x00000080)
#define UART_SCON_SM01_3                 ((uint32_t)0x000000B0)
#define UART_SCON_DBAUD                  ((uint32_t)0x00000200)


#ifdef USE_STDPERIPH_DRIVER
  //#include "stm32f0xx_conf.h"
#endif

/** @addtogroup Exported_macro
  * @{
  */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __HC32L0XX_H */


